// ===================== DICTIONARIES & TYPE DATA =====================
const DICT = {
  FACTORY_AREA: [
    "行政部-车队", "行政部-迎宾馆", "行政部-办公室", "行政部-接待餐厅", "人事部-人事", "安环部-保安", "安环部-安环", "安环部-消防",
    "品管部-船体检查一室", "品管部-机电检查一室", "品管部-售后服务室", "品管部-无损检测室", "品管部-质量管理室", "品管部-物资检验室", "品管部-计量理化实验中心",
    "品管部-机电检查二室", "品管部-船体检查二室", "品管部-焊接管理室", "船舶设计研究中心-综合室", "船舶设计研究中心-海工室", "船舶设计研究中心-船装室",
    "船舶设计研究中心-船体室", "船舶设计研究中心-电装室", "船舶设计研究中心-机装室", "船舶设计研究中心-总体室", "船舶设计研究中心-居装室",
    "船舶设计研究中心-上海分部", "分段一部-综合管理室", "分段一部-平组车间", "分段一部-曲组车间", "分段一部-分段一车间", "分段一部-分段二车间",
    "分段一部-分段三车间", "分段一部-分段四车间", "分段一部-支援车间", "分段一部-先行舾装车间", "分段一部-曲组三车间", "分段一部-曲组四车间",
    "分段一部-曲组五车间", "总装一部-综合管理室", "总装一部-船体车间", "总装一部-机装车间", "总装一部-调试中心", "总装一部-电装车间", "总装一部-支援车间",
    "总装一部-居装车间", "总装一部-船装车间", "总装一部-安装中心", "总装一部-涂装车间", "总装一部-作业车间", "总装一部-工程计划室", "生产管理部-生产计划室",
    "生产管理部-项目管理室", "生产管理部-生产支援室", "生产管理部-码头调度室", "生产保障部-动能管理室", "生产保障部-焊机工具一室", "生产保障部-起重设备一室",
    "生产保障部-通用设备一室", "生产保障部-综合管理室", "生产保障部-焊机工具二室", "生产保障部-通用设备二室", "生产保障部-起重设备二室", "精度部-生产技术室",
    "加工一部-钢加车间", "加工一部-综合管理室", "加工一部-组立车间", "基础管理-基础管理车间", "基础管理-准备车间", "基础管理-6S", "基础管理-环卫",
    "基础管理-维保车间", "基础管理-水运车间", "基础管理-三供车间", "外协管理部-委外加工室", "外协管理部-劳务管理室", "外协管理部-计价室", "外协管理部-成本室",
    "外协管理部-数据管理室", "工法部-综合管理室", "工法部-起运室", "工法部-工艺室", "工法部-焊接室", "装备制造部-综合管理室", "装备制造部-船配一车间",
    "装备制造部-绿色能源一车间", "装备制造部-绿色能源二车间", "分段二部-曲组三车间", "分段二部-曲组二车间", "分段二部-综合管理室", "分段二部-平组车间",
    "分段二部-曲组一车间", "分段二部-先行舾装车间", "加工二部-组立车间", "加工二部-钢加车间", "加工二部-准备车间", "加工二部-综合管理室", "总装二部-综合管理室",
    "总装二部-船体车间", "总装二部-机装车间", "总装二部-调试中心", "总装二部-电装车间", "总装二部-船装车间", "总装二部-支援车间", "总装二部-涂装车间",
    "居装二部-综合管理室", "居装二部-总组车间", "居装二部-分段车间", "居装二部-居装车间", "分段三部-平组内业车间", "分段三部-平组外业车间", "分段三部-先行舾装",
    "分段三部-综合管理室", "分段三部-支援车间", "电装调试部-电装一车间", "电装调试部-电装二车间", "电装调试部-调试一车间", "电装调试部-调试二车间",
    "电装调试部-综合管理室", "工程部-材料组", "水运部-船坞一车间", "水运部-船坞二车间", "水运部-船台车间", "水运部-综合管理室", "居装一部-总组车间",
    "居装一部-居装车间", "居装一部-综合管理室", "居装一部-分段车间", "总装三部-涂装一车间", "总装三部-支援一车间", "总装三部-船体一车间", "总装三部-船装一车间",
    "总装三部-机装一车间", "总装三部-综合管理一室", "总装三部-涂装二车间", "总装三部-支援二车间", "总装三部-船体二车间", "总装三部-船装二车间",
    "总装三部-机装二车间", "总装三部-综合管理二室", "总装三部-工程计划一室", "总装三部-工程计划二室", "总装三部-精度管理一室", "总装三部-精度管理二室",
    "总装三部-质量工艺一室", "总装三部-质量工艺二室", "造船-上海虹桥分公司-总经办-上海", "造船-上海虹桥分公司-机装室-上海", "造船-上海虹桥分公司-船体室-上海",
    "造船-上海虹桥分公司-行政部-上海", "造船-上海虹桥分公司-电装室-上海", "造船-上海虹桥分公司-商务部二部-上海", "造船-上海虹桥分公司-总体室-上海",
    "造船-上海虹桥分公司-居装室-上海", "造船-上海虹桥分公司-舾装室-上海", "造船-上海虹桥分公司-人事部-上海", "造船-南通分公司-行政部-南通",
    "造船-南通分公司-人事部-南通", "造船-南通分公司-居装室-南通", "造船-南通分公司-机装室-南通", "造船-南通分公司-船体室-南通", "造船-南通分公司-船装室-南通",
    "造船-南通分公司-电装室-南通", "工程公司舾装部-舾装一车间", "工程公司舾装部-舾装二车间", "工程公司舾装部-舾装三车间", "工程公司舾装部-舾装四车间",
    "工程公司舾装部-舾装五车间", "工程公司舾装部-舾装六车间", "工程公司舾装部-舾装七车间", "工程公司生产计划部-材料组", "工程公司生产计划部-电装管理室",
    "工程公司生产计划部-机装管理室", "工程公司生产计划部-涂装管理室", "工程公司生产计划部-船体管理室", "工程公司生产计划部-支援车间", "工程公司生产计划部-船装管理室",
    "工程公司机装部-机装一车间", "工程公司机装部-机装二车间", "工程公司机装部-机装三车间", "工程公司机装部-机装四车间", "工程公司调试部-调试一车间",
    "工程公司调试部-调试二车间", "工程公司调试部-调试三车间", "工程公司调试部-调试四车间", "工程公司船体部-船体一车间", "工程公司船体部-船体二车间",
    "工程公司船体部-船体三车间", "工程公司船体部-船体四车间", "工程公司船体部-船体五车间", "工程公司船体部-船体六车间", "工程公司船体部-船体七车间",
    "工程公司船体部-船体八车间", "制造技术部-总装精控一室", "制造技术部-总装精控二室", "制造技术部-分段精控一室", "制造技术部-分段精控二室",
    "制造技术部-加工精控一室", "制造技术部-加工精控二室", "制造技术部-先行脚手支援室", "制造技术部-生产技术室", "总装四部-船装车间", "总装四部-船体车间",
    "总装四部-综合管理室", "总装四部-涂装车间", "总装四部-机装车间", "总装四部-支援车间", "工程公司精度部-精度车间", "工程公司精度部-定位车间",
    "工程公司船装部-船装一车间", "工程公司船装部-船装二车间", "工程公司船装部-涂装一车间", "工程公司船装部-涂装二车间", "总经办", "财务管理部", "采购一部",
    "采购二部", "仓库", "法务部", "信息中心", "土建部", "造船安环部", "商务部", "涂装一部", "关务部", "项目部", "对外联络办", "资金管理部",
    "宿管办", "管舾部", "铁舾部", "镀锌车间", "商务二部", "新闻宣传部", "企管部", "研发部", "大连国际船舶设计中心", "工程仓库", "售后服务部",
    "工程公司安全管理部", "工程公司综合管理部", "工程公司成本核算部", "涂装二部", "恒力造船水稳料现场"
  ],
  DEPT_LIST: [
    "总经办", "财务管理部", "采购一部", "采购二部", "仓库", "法务部", "信息中心", "土建部", "安环部", "造船安环部", "商务部", "涂装一部",
    "关务部", "项目部", "对外联络办", "资金管理部", "宿管办", "管舾部", "铁舾部", "镀锌车间", "商务二部", "新闻宣传部", "企管部", "研发部",
    "工程部", "大连国际船舶设计中心", "工程仓库", "售后服务部", "工程公司安全管理部", "工程公司综合管理部", "工程公司成本核算部", "工程公司舾装部", "涂装二部",
    "恒力造船水稳料现场", "行政部", "人事部", "品管部", "船舶设计研究中心", "分段一部", "总装一部", "生产管理部", "生产保障部", "精度部", "加工一部",
    "基础管理", "外协管理部", "工法部", "装备制造部", "分段二部", "加工二部", "总装二部", "居装二部", "分段三部", "电装调试部", "水运部",
    "居装一部", "总装三部", "造船-上海虹桥分公司", "造船-南通分公司", "工程公司生产计划部", "工程公司机装部", "工程公司调试部", "工程公司船体部",
    "制造技术部", "总装四部", "工程公司精度部", "工程公司船装部"
  ],

  WORKSHOP_DEPT_MAP: {
    "人事部-人事": "人事部",
    "分段一部-先行舾装车间": "分段一部",
    "分段一部-分段一车间": "分段一部",
    "分段一部-分段三车间": "分段一部",
    "分段一部-分段二车间": "分段一部",
    "分段一部-分段四车间": "分段一部",
    "分段一部-平组车间": "分段一部",
    "分段一部-支援车间": "分段一部",
    "分段一部-曲组三车间": "分段一部",
    "分段一部-曲组五车间": "分段一部",
    "分段一部-曲组四车间": "分段一部",
    "分段一部-曲组车间": "分段一部",
    "分段一部-综合管理室": "分段一部",
    "分段三部-先行舾装": "分段三部",
    "分段三部-平组内业车间": "分段三部",
    "分段三部-平组外业车间": "分段三部",
    "分段三部-支援车间": "分段三部",
    "分段三部-综合管理室": "分段三部",
    "分段二部-先行舾装车间": "分段二部",
    "分段二部-平组车间": "分段二部",
    "分段二部-曲组一车间": "分段二部",
    "分段二部-曲组三车间": "分段二部",
    "分段二部-曲组二车间": "分段二部",
    "分段二部-综合管理室": "分段二部",
    "制造技术部-先行脚手支援室": "制造技术部",
    "制造技术部-分段精控一室": "制造技术部",
    "制造技术部-分段精控二室": "制造技术部",
    "制造技术部-加工精控一室": "制造技术部",
    "制造技术部-加工精控二室": "制造技术部",
    "制造技术部-总装精控一室": "制造技术部",
    "制造技术部-总装精控二室": "制造技术部",
    "制造技术部-生产技术室": "制造技术部",
    "加工一部-组立车间": "加工一部",
    "加工一部-综合管理室": "加工一部",
    "加工一部-钢加车间": "加工一部",
    "加工二部-准备车间": "加工二部",
    "加工二部-组立车间": "加工二部",
    "加工二部-综合管理室": "加工二部",
    "加工二部-钢加车间": "加工二部",
    "品管部-售后服务室": "品管部",
    "品管部-无损检测室": "品管部",
    "品管部-机电检查一室": "品管部",
    "品管部-机电检查二室": "品管部",
    "品管部-焊接管理室": "品管部",
    "品管部-物资检验室": "品管部",
    "品管部-船体检查一室": "品管部",
    "品管部-船体检查二室": "品管部",
    "品管部-计量理化实验中心": "品管部",
    "品管部-质量管理室": "品管部",
    "基础管理-6S": "基础管理",
    "基础管理-三供车间": "基础管理",
    "基础管理-准备车间": "基础管理",
    "基础管理-基础管理车间": "基础管理",
    "基础管理-水运车间": "基础管理",
    "基础管理-环卫": "基础管理",
    "基础管理-维保车间": "基础管理",
    "外协管理部-劳务管理室": "外协管理部",
    "外协管理部-委外加工室": "外协管理部",
    "外协管理部-成本室": "外协管理部",
    "外协管理部-数据管理室": "外协管理部",
    "外协管理部-计价室": "外协管理部",
    "安环部-保安": "安环部",
    "安环部-安环": "安环部",
    "安环部-消防": "安环部",
    "居装一部-分段车间": "居装一部",
    "居装一部-居装车间": "居装一部",
    "居装一部-总组车间": "居装一部",
    "居装一部-综合管理室": "居装一部",
    "居装二部-分段车间": "居装二部",
    "居装二部-居装车间": "居装二部",
    "居装二部-总组车间": "居装二部",
    "居装二部-综合管理室": "居装二部",
    "工法部-工艺室": "工法部",
    "工法部-焊接室": "工法部",
    "工法部-综合管理室": "工法部",
    "工法部-起运室": "工法部",
    "工程公司机装部-机装一车间": "工程公司机装部",
    "工程公司机装部-机装三车间": "工程公司机装部",
    "工程公司机装部-机装二车间": "工程公司机装部",
    "工程公司机装部-机装四车间": "工程公司机装部",
    "工程公司生产计划部-支援车间": "工程公司生产计划部",
    "工程公司生产计划部-机装管理室": "工程公司生产计划部",
    "工程公司生产计划部-材料组": "工程公司生产计划部",
    "工程公司生产计划部-涂装管理室": "工程公司生产计划部",
    "工程公司生产计划部-电装管理室": "工程公司生产计划部",
    "工程公司生产计划部-船体管理室": "工程公司生产计划部",
    "工程公司生产计划部-船装管理室": "工程公司生产计划部",
    "工程公司精度部-定位车间": "工程公司精度部",
    "工程公司精度部-精度车间": "工程公司精度部",
    "工程公司船体部-船体一车间": "工程公司船体部",
    "工程公司船体部-船体七车间": "工程公司船体部",
    "工程公司船体部-船体三车间": "工程公司船体部",
    "工程公司船体部-船体二车间": "工程公司船体部",
    "工程公司船体部-船体五车间": "工程公司船体部",
    "工程公司船体部-船体八车间": "工程公司船体部",
    "工程公司船体部-船体六车间": "工程公司船体部",
    "工程公司船体部-船体四车间": "工程公司船体部",
    "工程公司船装部-涂装一车间": "工程公司船装部",
    "工程公司船装部-涂装二车间": "工程公司船装部",
    "工程公司船装部-船装一车间": "工程公司船装部",
    "工程公司船装部-船装二车间": "工程公司船装部",
    "工程公司舾装部-舾装一车间": "工程公司舾装部",
    "工程公司舾装部-舾装七车间": "工程公司舾装部",
    "工程公司舾装部-舾装三车间": "工程公司舾装部",
    "工程公司舾装部-舾装二车间": "工程公司舾装部",
    "工程公司舾装部-舾装五车间": "工程公司舾装部",
    "工程公司舾装部-舾装六车间": "工程公司舾装部",
    "工程公司舾装部-舾装四车间": "工程公司舾装部",
    "工程公司调试部-调试一车间": "工程公司调试部",
    "工程公司调试部-调试三车间": "工程公司调试部",
    "工程公司调试部-调试二车间": "工程公司调试部",
    "工程公司调试部-调试四车间": "工程公司调试部",
    "工程部-材料组": "工程部",
    "总装一部-作业车间": "总装一部",
    "总装一部-安装中心": "总装一部",
    "总装一部-居装车间": "总装一部",
    "总装一部-工程计划室": "总装一部",
    "总装一部-支援车间": "总装一部",
    "总装一部-机装车间": "总装一部",
    "总装一部-涂装车间": "总装一部",
    "总装一部-电装车间": "总装一部",
    "总装一部-综合管理室": "总装一部",
    "总装一部-船体车间": "总装一部",
    "总装一部-船装车间": "总装一部",
    "总装一部-调试中心": "总装一部",
    "总装三部-工程计划一室": "总装三部",
    "总装三部-工程计划二室": "总装三部",
    "总装三部-支援一车间": "总装三部",
    "总装三部-支援二车间": "总装三部",
    "总装三部-机装一车间": "总装三部",
    "总装三部-机装二车间": "总装三部",
    "总装三部-涂装一车间": "总装三部",
    "总装三部-涂装二车间": "总装三部",
    "总装三部-精度管理一室": "总装三部",
    "总装三部-精度管理二室": "总装三部",
    "总装三部-综合管理一室": "总装三部",
    "总装三部-综合管理二室": "总装三部",
    "总装三部-船体一车间": "总装三部",
    "总装三部-船体二车间": "总装三部",
    "总装三部-船装一车间": "总装三部",
    "总装三部-船装二车间": "总装三部",
    "总装三部-质量工艺一室": "总装三部",
    "总装三部-质量工艺二室": "总装三部",
    "总装二部-支援车间": "总装二部",
    "总装二部-机装车间": "总装二部",
    "总装二部-涂装车间": "总装二部",
    "总装二部-电装车间": "总装二部",
    "总装二部-综合管理室": "总装二部",
    "总装二部-船体车间": "总装二部",
    "总装二部-船装车间": "总装二部",
    "总装二部-调试中心": "总装二部",
    "总装四部-支援车间": "总装四部",
    "总装四部-机装车间": "总装四部",
    "总装四部-涂装车间": "总装四部",
    "总装四部-综合管理室": "总装四部",
    "总装四部-船体车间": "总装四部",
    "总装四部-船装车间": "总装四部",
    "水运部-综合管理室": "水运部",
    "水运部-船台车间": "水运部",
    "水运部-船坞一车间": "水运部",
    "水运部-船坞二车间": "水运部",
    "生产保障部-动能管理室": "生产保障部",
    "生产保障部-焊机工具一室": "生产保障部",
    "生产保障部-焊机工具二室": "生产保障部",
    "生产保障部-综合管理室": "生产保障部",
    "生产保障部-起重设备一室": "生产保障部",
    "生产保障部-起重设备二室": "生产保障部",
    "生产保障部-通用设备一室": "生产保障部",
    "生产保障部-通用设备二室": "生产保障部",
    "生产管理部-生产支援室": "生产管理部",
    "生产管理部-生产计划室": "生产管理部",
    "生产管理部-码头调度室": "生产管理部",
    "生产管理部-项目管理室": "生产管理部",
    "电装调试部-电装一车间": "电装调试部",
    "电装调试部-电装二车间": "电装调试部",
    "电装调试部-综合管理室": "电装调试部",
    "电装调试部-调试一车间": "电装调试部",
    "电装调试部-调试二车间": "电装调试部",
    "精度部-生产技术室": "精度部",
    "船舶设计研究中心-上海分部": "船舶设计研究中心",
    "船舶设计研究中心-居装室": "船舶设计研究中心",
    "船舶设计研究中心-总体室": "船舶设计研究中心",
    "船舶设计研究中心-机装室": "船舶设计研究中心",
    "船舶设计研究中心-海工室": "船舶设计研究中心",
    "船舶设计研究中心-电装室": "船舶设计研究中心",
    "船舶设计研究中心-综合室": "船舶设计研究中心",
    "船舶设计研究中心-船体室": "船舶设计研究中心",
    "船舶设计研究中心-船装室": "船舶设计研究中心",
    "行政部-办公室": "行政部",
    "行政部-接待餐厅": "行政部",
    "行政部-车队": "行政部",
    "行政部-迎宾馆": "行政部",
    "装备制造部-综合管理室": "装备制造部",
    "装备制造部-绿色能源一车间": "装备制造部",
    "装备制造部-绿色能源二车间": "装备制造部",
    "装备制造部-船配一车间": "装备制造部",
    "造船-上海虹桥分公司-人事部-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-商务部二部-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-居装室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-总体室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-总经办-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-机装室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-电装室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-船体室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-舾装室-上海": "造船-上海虹桥分公司",
    "造船-上海虹桥分公司-行政部-上海": "造船-上海虹桥分公司",
    "造船-南通分公司-人事部-南通": "造船-南通分公司",
    "造船-南通分公司-居装室-南通": "造船-南通分公司",
    "造船-南通分公司-机装室-南通": "造船-南通分公司",
    "造船-南通分公司-电装室-南通": "造船-南通分公司",
    "造船-南通分公司-船体室-南通": "造船-南通分公司",
    "造船-南通分公司-船装室-南通": "造船-南通分公司",
    "造船-南通分公司-行政部-南通": "造船-南通分公司"
  },

  DEVICE_STATUS: ['在用','封存','闲置','待修','报废'],
  MAINTENANCE_TYPE: ['定期维保','临时维保'],
  MAINTENANCE_RESULT: ['正常','异常'],
  SCRAP_DISPOSAL: ['变卖处置','报废回收','留存拆解','其他'],
  ASSET_PURPOSE: ['生产用','管理用','辅助用'],
  UNIT: ['台','辆','套','个','桶','米','平方米','吨','件'],
  ACQUISITION_METHOD: ['新购','自建','调入','捐赠','租赁','投资者投入','其他'],
  VALUE_TYPE: ['原值','净值','评估值','重置成本'],
  BOOKING_STATUS: ['已入账','未入账','部分入账'],
  DEPRECIATION_STATUS: ['正常计提','暂停计提','已提足','无需计提'],
  DEPRECIATION_METHOD: ['年限平均法','工作量法','双倍余额递减法','年数总和法'],
  APPROVAL_STATUS: ['待审批','审批中','已通过','已驳回'],
  APPLICATION_TYPE: ['调拨','报废'],
  PLAN_LEVEL: ['一级保养','二级保养'],
  PLAN_STATUS: ['待执行','进行中','已完成','已超期'],
  INSPECTION_TYPE: ['定期检查','专项检查'],
  WORK_ORDER_TYPE: ['故障维修','预防性维修','改善性维修'],
  WORK_ORDER_STATUS: ['待派工','待维修','维修中','待验收','已完成'],
};

var DEFAULT_OWNERSHIP_UNIT = '恒力造船（大连）有限公司';
var DEFAULT_MANAGE_DEPT = '生产保障部';
var DEFAULT_MANAGE_DEPT_CODE = '2200';

// Get top-level asset category names from DEVICE_TYPE_TREE
function getTopLevelCategories() {
  if (typeof DEVICE_TYPE_TREE === 'undefined') return [];
  return Object.keys(DEVICE_TYPE_TREE).sort().map(function(k) { return DEVICE_TYPE_TREE[k].name; });
}

// Get top-level category codes from DEVICE_TYPE_TREE
function getCategoryCodes() {
  if (typeof DEVICE_TYPE_TREE === 'undefined') return [];
  return Object.keys(DEVICE_TYPE_TREE).sort();
}

var DEVICE_TYPE_TREE = {
    "00": {
      children: {
        "01": {
          children: {
            "01": {
              code: "000101",
              name: "普通车床",
              remark: "通用"
            },
            "02": {
              code: "000102",
              name: "自动车床",
              remark: "通用"
            },
            "03": {
              code: "000103",
              name: "仿形车床",
              remark: "通用"
            },
            "04": {
              code: "000104",
              name: "落地车床",
              remark: "通用"
            },
            "05": {
              code: "000105",
              name: "立式车床",
              remark: "通用"
            },
            "06": {
              code: "000106",
              name: "切料车床",
              remark: "通用"
            },
            "07": {
              code: "000107",
              name: "数控车床",
              remark: "通用"
            },
            "99": {
              code: "000199",
              name: "其它车床",
              remark: "通用"
            }
          },
          name: "车床"
        },
        "02": {
          children: {
            "01": {
              code: "000201",
              name: "仪表铣床",
              remark: "通用"
            },
            "02": {
              code: "000202",
              name: "卧式铣床",
              remark: "通用"
            },
            "03": {
              code: "000203",
              name: "立式铣床",
              remark: "通用"
            },
            "04": {
              code: "000204",
              name: "万能铣床",
              remark: "通用"
            },
            "05": {
              code: "000205",
              name: "工具铣床",
              remark: "通用"
            },
            "06": {
              code: "000206",
              name: "仿形铣床",
              remark: "通用"
            },
            "07": {
              code: "000207",
              name: "龙门铣床",
              remark: "通用"
            },
            "08": {
              code: "000208",
              name: "端面铣床",
              remark: "通用"
            },
            "09": {
              code: "000209",
              name: "数控铣床",
              remark: "通用"
            }
          },
          name: "铣床"
        },
        "03": {
          children: {
            "01": {
              code: "000301",
              name: "龙门刨床",
              remark: "通用"
            },
            "02": {
              code: "000302",
              name: "牛头刨床",
              remark: "通用"
            },
            "03": {
              code: "000303",
              name: "仿形刨床",
              remark: "通用"
            },
            "04": {
              code: "000304",
              name: "刨边机床",
              remark: "通用"
            },
            "05": {
              code: "000305",
              name: "数控刨床",
              remark: "通用"
            },
            "10": {
              code: "000310",
              name: "其它刨床",
              remark: "通用"
            },
            "11": {
              code: "000311",
              name: "插床",
              remark: "通用"
            },
            "20": {
              code: "000320",
              name: "其它插床",
              remark: "通用"
            },
            "21": {
              code: "000321",
              name: "立式拉床",
              remark: "通用"
            },
            "22": {
              code: "000322",
              name: "卧式拉床",
              remark: "通用"
            },
            "30": {
              code: "000330",
              name: "其它拉床",
              remark: "通用"
            }
          },
          name: "刨、插、拉床"
        },
        "04": {
          children: {
            "01": {
              code: "000401",
              name: "平面磨床",
              remark: "通用"
            },
            "02": {
              code: "000402",
              name: "内园磨床",
              remark: "通用"
            },
            "03": {
              code: "000403",
              name: "无心磨床",
              remark: "通用"
            },
            "04": {
              code: "000404",
              name: "外园磨床",
              remark: "通用"
            },
            "05": {
              code: "000405",
              name: "万能磨床",
              remark: "通用"
            },
            "06": {
              code: "000406",
              name: "导轨磨床",
              remark: "通用"
            },
            "07": {
              code: "000407",
              name: "龙门磨床",
              remark: "通用"
            },
            "08": {
              code: "000408",
              name: "数控磨床",
              remark: "通用"
            },
            "99": {
              code: "000499",
              name: "其它磨床",
              remark: "通用"
            }
          },
          name: "磨床"
        },
        "05": {
          children: {
            "01": {
              code: "000501",
              name: "立式钻床",
              remark: "通用"
            },
            "02": {
              code: "000502",
              name: "卧式钻床",
              remark: "通用"
            },
            "03": {
              code: "000503",
              name: "台式钻床",
              remark: "通用"
            },
            "04": {
              code: "000504",
              name: "摇臂钻床",
              remark: "通用"
            },
            "05": {
              code: "000505",
              name: "万能钻床",
              remark: "通用"
            },
            "06": {
              code: "000506",
              name: "数控钻床",
              remark: "通用"
            },
            "10": {
              code: "000510",
              name: "其它钻床",
              remark: "通用"
            },
            "11": {
              code: "000511",
              name: "卧式镗床",
              remark: "通用"
            },
            "12": {
              code: "000512",
              name: "立式镗床",
              remark: "通用"
            },
            "13": {
              code: "000513",
              name: "落地镗床",
              remark: "通用"
            },
            "14": {
              code: "000514",
              name: "数控镗床",
              remark: "通用"
            },
            "20": {
              code: "000520",
              name: "其它镗床",
              remark: "通用"
            }
          },
          name: "钻、镗床"
        },
        "06": {
          children: {
            "01": {
              code: "000601",
              name: "滚齿机",
              remark: "通用"
            },
            "02": {
              code: "000602",
              name: "插齿机",
              remark: "通用"
            },
            "03": {
              code: "000603",
              name: "铣齿机",
              remark: "通用"
            },
            "04": {
              code: "000604",
              name: "剃齿机",
              remark: "通用"
            },
            "05": {
              code: "000605",
              name: "珩齿机",
              remark: "通用"
            },
            "06": {
              code: "000606",
              name: "刨齿机",
              remark: "通用"
            },
            "07": {
              code: "000607",
              name: "数控齿轮加工机床",
              remark: "通用"
            }
          },
          name: "齿轮加工机床"
        },
        "07": {
          children: {
            "01": {
              code: "000701",
              name: "螺纹车床",
              remark: "通用"
            },
            "02": {
              code: "000702",
              name: "丝杆车床",
              remark: "通用"
            },
            "03": {
              code: "000703",
              name: "螺纹铣床",
              remark: "通用"
            },
            "04": {
              code: "000704",
              name: "涡杆铣床",
              remark: "通用"
            },
            "05": {
              code: "000705",
              name: "螺纹磨床",
              remark: "通用"
            },
            "06": {
              code: "000706",
              name: "涡杆磨床",
              remark: "通用"
            },
            "07": {
              code: "000707",
              name: "丝锥磨床",
              remark: "通用"
            },
            "08": {
              code: "000708",
              name: "丝杆磨床",
              remark: "通用"
            },
            "09": {
              code: "000709",
              name: "管子螺纹机",
              remark: "通用"
            }
          },
          name: "螺纹加工机床"
        },
        "08": {
          children: {
            "01": {
              code: "000801",
              name: "加工中心",
              remark: "通用"
            },
            "10": {
              code: "000810",
              name: "其它加工中心",
              remark: "通用"
            },
            "11": {
              code: "000811",
              name: "组合机床",
              remark: "通用"
            },
            "20": {
              code: "000820",
              name: "其它组合机床",
              remark: "通用"
            }
          },
          name: "加工中心及组合机床"
        },
        "09": {
          children: {
            "01": {
              code: "000901",
              name: "电加工机床",
              remark: "通用"
            },
            "10": {
              code: "000910",
              name: "其它电加工机床",
              remark: "通用"
            },
            "20": {
              code: "000920",
              name: "其它特种机床",
              remark: "通用"
            }
          },
          name: "电加工及特种机床"
        },
        "10": {
          children: {
            "01": {
              code: "001001",
              name: "管子坡口机",
              remark: "通用"
            },
            "02": {
              code: "001002",
              name: "板边坡口机",
              remark: "通用"
            }
          },
          name: "其他金切设备"
        }
      },
      name: "金切设备"
    },
    "01": {
      children: {
        "01": {
          children: {
            "01": {
              code: "010101",
              name: "卧式液压机",
              remark: "通用"
            },
            "02": {
              code: "010102",
              name: "立式液压机",
              remark: "通用"
            },
            "03": {
              code: "010103",
              name: "单柱液压机",
              remark: "通用"
            },
            "04": {
              code: "010104",
              name: "双柱液压机",
              remark: "通用"
            },
            "05": {
              code: "010105",
              name: "四柱液压机",
              remark: "通用"
            },
            "06": {
              code: "010106",
              name: "冲压液压机",
              remark: "通用"
            },
            "07": {
              code: "010107",
              name: "挤压液压机",
              remark: "通用"
            }
          },
          name: "液压机"
        },
        "02": {
          children: {
            "01": {
              code: "010201",
              name: "摩擦压力机",
              remark: "通用"
            },
            "02": {
              code: "010202",
              name: "螺旋压力机",
              remark: "通用"
            }
          },
          name: "机械压力机"
        },
        "03": {
          children: {
            "01": {
              code: "010301",
              name: "板材剪切机",
              remark: "通用"
            },
            "02": {
              code: "010302",
              name: "型材剪切机",
              remark: "通用"
            },
            "03": {
              code: "010303",
              name: "曲线剪切机",
              remark: "通用"
            },
            "04": {
              code: "010304",
              name: "棒料剪断机",
              remark: "通用"
            },
            "05": {
              code: "010305",
              name: "联合冲剪机",
              remark: "通用"
            },
            "06": {
              code: "010306",
              name: "龙门剪切床",
              remark: "通用"
            },
            "07": {
              code: "010307",
              name: "滚动剪切机",
              remark: "通用"
            },
            "08": {
              code: "010308",
              name: "震动剪切床",
              remark: "通用"
            }
          },
          name: "剪切机"
        },
        "04": {
          children: {
            "01": {
              code: "010401",
              name: "弯板机",
              remark: "通用"
            },
            "02": {
              code: "010402",
              name: "折边机",
              remark: "通用"
            },
            "03": {
              code: "010403",
              name: "弯管机",
              remark: "通用"
            },
            "04": {
              code: "010404",
              name: "T型材冷弯机",
              remark: "通用"
            },
            "05": {
              code: "010405",
              name: "肋骨冷弯机",
              remark: "通用"
            },
            "06": {
              code: "010406",
              name: "数控弯曲机",
              remark: "通用"
            }
          },
          name: "折弯机"
        },
        "05": {
          children: {
            "01": {
              code: "010501",
              name: "卷板机",
              remark: "通用"
            },
            "02": {
              code: "010502",
              name: "三辊卷板机",
              remark: "通用"
            },
            "03": {
              code: "010503",
              name: "四辊卷板机",
              remark: "通用"
            },
            "04": {
              code: "010504",
              name: "卷筒机",
              remark: "通用"
            }
          },
          name: "卷弯机"
        },
        "06": {
          children: {
            "01": {
              code: "010601",
              name: "型材校直机",
              remark: "通用"
            },
            "02": {
              code: "010602",
              name: "管材校直机",
              remark: "通用"
            },
            "03": {
              code: "010603",
              name: "板料校平机",
              remark: "通用"
            }
          },
          name: "准直机"
        },
        "07": {
          children: {
            "01": {
              code: "010701",
              name: "旋压机",
              remark: "通用"
            },
            "02": {
              code: "010702",
              name: "倒棱机",
              remark: "通用"
            },
            "03": {
              code: "010703",
              name: "冲孔机",
              remark: "通用"
            },
            "04": {
              code: "010704",
              name: "扩管机",
              remark: "通用"
            },
            "05": {
              code: "010705",
              name: "卡管机",
              remark: "通用"
            },
            "06": {
              code: "010706",
              name: "压箍机",
              remark: "通用"
            }
          },
          name: "整形机"
        },
        "08": {
          children: {
            "01": {
              code: "010801",
              name: "液压单元",
              remark: "通用"
            },
            "02": {
              code: "010802",
              name: "液压油缸",
              remark: "通用"
            },
            "03": {
              code: "010803",
              name: "顶升装置",
              remark: "通用"
            }
          },
          name: "液压装置"
        }
      },
      name: "压力机械"
    },
    "02": {
      children: {
        "01": {
          children: {
            "01": {
              code: "020101",
              name: "通用桥式起重机",
              remark: "起重"
            },
            "02": {
              code: "020102",
              name: "梁式起重机（葫芦）",
              remark: "起重"
            },
            "03": {
              code: "020103",
              name: "门式起重机",
              remark: "起重"
            },
            "04": {
              code: "020104",
              name: "半门式起重机",
              remark: "起重"
            },
            "05": {
              code: "020105",
              name: "龙门起重机",
              remark: "起重"
            },
            "06": {
              code: "020106",
              name: "门座起重机",
              remark: "起重"
            },
            "07": {
              code: "020107",
              name: "通用门式起重机",
              remark: "起重"
            },
            "08": {
              code: "020108",
              name: "塔式起重机",
              remark: "起重"
            },
            "09": {
              code: "020109",
              name: "悬臂起重机",
              remark: "起重"
            },
            "10": {
              code: "020110",
              name: "履带起重机",
              remark: "起重"
            },
            "11": {
              code: "020111",
              name: "汽车起重机",
              remark: "起重"
            }
          },
          name: "起重机"
        },
        "02": {
          children: {
            "01": {
              code: "020201",
              name: "卷扬机",
              remark: "通用"
            },
            "02": {
              code: "020202",
              name: "电动卷扬机",
              remark: "通用"
            },
            "03": {
              code: "020203",
              name: "引船机",
              remark: "通用"
            },
            "04": {
              code: "020204",
              name: "导缆拖车",
              remark: "通用"
            }
          },
          name: "卷扬机"
        },
        "03": {
          children: {
            "01": {
              code: "020301",
              name: "载货电梯",
              remark: "起重"
            },
            "02": {
              code: "020302",
              name: "载人电梯",
              remark: "起重"
            },
            "03": {
              code: "020303",
              name: "自动扶梯",
              remark: "起重"
            },
            "04": {
              code: "020304",
              name: "登船梯（塔）",
              remark: "起重"
            }
          },
          name: "电梯"
        },
        "04": {
          children: {
            "01": {
              code: "020401",
              name: "施工升降机",
              remark: "通用"
            },
            "02": {
              code: "020402",
              name: "简易升降机",
              remark: "通用"
            },
            "03": {
              code: "020403",
              name: "高空作业车",
              remark: "通用"
            },
            "05": {
              code: "020405",
              name: "电动吊篮",
              remark: "起重"
            }
          },
          name: "升降机"
        }
      },
      name: "起重设备"
    },
    "03": {
      children: {
        "01": {
          children: {
            "01": {
              code: "030101",
              name: "叉车",
              remark: "通用"
            },
            "02": {
              code: "030102",
              name: "滑移装载机",
              remark: "通用"
            },
            "03": {
              code: "030103",
              name: "铲车",
              remark: "通用"
            },
            "04": {
              code: "030104",
              name: "翻斗车",
              remark: "通用"
            },
            "05": {
              code: "030105",
              name: "挂车",
              remark: "通用"
            },
            "06": {
              code: "030106",
              name: "电动平车",
              remark: "通用"
            },
            "07": {
              code: "030107",
              name: "无动力平车",
              remark: "通用"
            },
            "08": {
              code: "030108",
              name: "载货卡车",
              remark: "通用"
            },
            "09": {
              code: "030109",
              name: "牵引车",
              remark: "通用"
            },
            "10": {
              code: "030110",
              name: "挂车",
              remark: "通用"
            },
            "11": {
              code: "030111",
              name: "平板车",
              remark: "通用"
            }
          },
          name: "生产车辆"
        },
        "02": {
          children: {
            "01": {
              code: "030201",
              name: "大客车",
              remark: "通用"
            },
            "02": {
              code: "030202",
              name: "中巴",
              remark: "通用"
            },
            "03": {
              code: "030203",
              name: "面包车",
              remark: "通用"
            },
            "04": {
              code: "030204",
              name: "小客车",
              remark: "通用"
            },
            "05": {
              code: "030205",
              name: "皮卡车",
              remark: "通用"
            },
            "06": {
              code: "030206",
              name: "轿车",
              remark: "通用"
            },
            "07": {
              code: "030207",
              name: "摩托车",
              remark: "通用"
            }
          },
          name: "办公车辆"
        },
        "03": {
          children: {
            "08": {
              code: "030308",
              name: "消防车",
              remark: "通用"
            },
            "09": {
              code: "030309",
              name: "警车",
              remark: "通用"
            },
            "10": {
              code: "030310",
              name: "洒水车",
              remark: "通用"
            },
            "11": {
              code: "030311",
              name: "救护车",
              remark: "通用"
            },
            "12": {
              code: "030312",
              name: "三轮电动车",
              remark: "通用"
            },
            "13": {
              code: "030313",
              name: "两轮电动车",
              remark: "通用"
            }
          },
          name: "特种车辆"
        },
        "04": {
          children: {
            "01": {
              code: "030401",
              name: "拖轮",
              remark: "通用"
            },
            "02": {
              code: "030402",
              name: "驳船",
              remark: "通用"
            },
            "03": {
              code: "030403",
              name: "工程船",
              remark: "通用"
            },
            "04": {
              code: "030404",
              name: "摩托艇",
              remark: "通用"
            },
            "05": {
              code: "030405",
              name: "浮船坞",
              remark: "通用"
            }
          },
          name: "船舶"
        },
        "05": {
          children: {
            "01": {
              code: "030501",
              name: "运输辊道",
              remark: "通用"
            }
          },
          name: "传送设备"
        }
      },
      name: "运输设备"
    },
    "04": {
      children: {
        "01": {
          children: {
            "02": {
              code: "040102",
              name: "埋弧焊机",
              remark: "焊机"
            },
            "03": {
              code: "040103",
              name: "氩弧焊机",
              remark: "焊机"
            },
            "04": {
              code: "040104",
              name: "二氧焊机",
              remark: "焊机"
            }
          },
          name: "焊接设备"
        },
        "02": {
          children: {
            "01": {
              code: "040201",
              name: "自动焊小车",
              remark: "焊机"
            },
            "02": {
              code: "040202",
              name: "焊剂烘干箱",
              remark: "焊机"
            },
            "03": {
              code: "040203",
              name: "焊剂烘干机",
              remark: "焊机"
            }
          },
          name: "焊接辅助设备"
        },
        "03": {
          children: {
            "01": {
              code: "040301",
              name: "多头焊接装置",
              remark: "焊机"
            },
            "02": {
              code: "040302",
              name: "龙门自动焊压梁机",
              remark: "焊机"
            },
            "03": {
              code: "040303",
              name: "焊接机器人",
              remark: "焊机"
            }
          },
          name: "焊接装置"
        },
        "04": {
          children: {
            "01": {
              code: "040401",
              name: "等离子切割机",
              remark: "焊机"
            },
            "02": {
              code: "040402",
              name: "激光切割机",
              remark: "焊机"
            },
            "03": {
              code: "040403",
              name: "空气等离子切割机",
              remark: "焊机"
            },
            "04": {
              code: "040404",
              name: "半自动火焰切割机",
              remark: "焊机"
            }
          },
          name: "切割设备"
        },
        "05": {
          children: {
            "02": {
              code: "040502",
              name: "印字划线机",
              remark: "焊机"
            }
          },
          name: "切割辅助设备"
        }
      },
      name: "焊切设备"
    },
    "05": {
      children: {
        "01": {
          children: {
            "01": {
              code: "050101",
              name: "电力变压器",
              remark: "电气"
            },
            "02": {
              code: "050102",
              name: "高压互感器",
              remark: "电气"
            },
            "03": {
              code: "050103",
              name: "高压电容器",
              remark: "电气"
            },
            "04": {
              code: "050104",
              name: "高压电抗器",
              remark: "电气"
            },
            "05": {
              code: "050105",
              name: "高压断路器",
              remark: "电气"
            },
            "06": {
              code: "050106",
              name: "高压负荷开关",
              remark: "电气"
            },
            "07": {
              code: "050107",
              name: "高压隔离开关",
              remark: "电气"
            },
            "08": {
              code: "050108",
              name: "高压接地开关",
              remark: "电气"
            },
            "09": {
              code: "050109",
              name: "高压配电柜",
              remark: "电气"
            },
            "10": {
              code: "050110",
              name: "箱式变电站",
              remark: "电气"
            }
          },
          name: "变电设备"
        },
        "02": {
          children: {
            "01": {
              code: "050201",
              name: "低压配电柜",
              remark: "电气"
            },
            "02": {
              code: "050202",
              name: "低压开关柜",
              remark: "电气"
            },
            "03": {
              code: "050203",
              name: "低压电容器",
              remark: "电气"
            },
            "04": {
              code: "050204",
              name: "补偿柜",
              remark: "电气"
            },
            "05": {
              code: "050205",
              name: "交直流电源柜",
              remark: "电气"
            },
            "06": {
              code: "050206",
              name: "进线柜",
              remark: "电气"
            },
            "07": {
              code: "050207",
              name: "联络柜",
              remark: "电气"
            },
            "08": {
              code: "050208",
              name: "控制台",
              remark: "电气"
            },
            "09": {
              code: "050209",
              name: "电容柜",
              remark: "电气"
            },
            "10": {
              code: "050210",
              name: "直流电源屏",
              remark: "电气"
            },
            "11": {
              code: "050211",
              name: "动力配电箱",
              remark: "电气"
            }
          },
          name: "配电设备"
        },
        "03": {
          children: {
            "01": {
              code: "050301",
              name: "高压输电线路",
              remark: "电气"
            },
            "02": {
              code: "050302",
              name: "低压输电线路",
              remark: "电气"
            },
            "03": {
              code: "050303",
              name: "电讯输电线路",
              remark: "电气"
            },
            "04": {
              code: "050304",
              name: "高压电缆",
              remark: "电气"
            },
            "05": {
              code: "050305",
              name: "低压电缆",
              remark: "电气"
            },
            "06": {
              code: "050306",
              name: "电讯电缆",
              remark: "电气"
            },
            "08": {
              code: "050308",
              name: "照明线路",
              remark: "电气"
            },
            "09": {
              code: "050309",
              name: "封闭母线",
              remark: "电气"
            }
          },
          name: "输电线路"
        },
        "04": {
          children: {
            "01": {
              code: "050401",
              name: "同步发电机",
              remark: "电气"
            }
          },
          name: "电气装置"
        },
        "05": {
          children: {
            "01": {
              code: "050501",
              name: "厂房照明系统",
              remark: "电气"
            },
            "02": {
              code: "050502",
              name: "探照灯",
              remark: "电气"
            },
            "03": {
              code: "050503",
              name: "照明灯",
              remark: "电气"
            },
            "04": {
              code: "050504",
              name: "高杆灯",
              remark: "电气"
            },
            "05": {
              code: "050505",
              name: "路灯",
              remark: "电气"
            }
          },
          name: "照明装置"
        }
      },
      name: "电气设备"
    },
    "06": {
      children: {
        "01": {
          children: {
            "01": {
              code: "060101",
              name: "空压机",
              remark: "动能"
            },
            "02": {
              code: "060102",
              name: "干燥机",
              remark: "动能"
            },
            "03": {
              code: "060103",
              name: "循环水系统",
              remark: "动能"
            },
            "04": {
              code: "060104",
              name: "冷冻水系统",
              remark: "动能"
            },
            "05": {
              code: "060105",
              name: "其他辅助设备设施",
              remark: "动能"
            }
          },
          name: "空压站设备"
        },
        "02": {
          children: {
            "01": {
              code: "060201",
              name: "天然气供气系统-储罐",
              remark: "动能"
            },
            "02": {
              code: "060202",
              name: "天然气供气系统-汽化器",
              remark: "动能"
            },
            "03": {
              code: "060203",
              name: "二氧化碳供气系统-储罐",
              remark: "动能"
            },
            "04": {
              code: "060204",
              name: "二氧化碳供气系统-汽化器",
              remark: "动能"
            },
            "05": {
              code: "060205",
              name: "氧气供气系统-储罐",
              remark: "动能"
            },
            "06": {
              code: "060206",
              name: "氧气供气系统-汽化器",
              remark: "动能"
            },
            "07": {
              code: "060207",
              name: "其他辅助设备设施",
              remark: "动能"
            }
          },
          name: "气站设备"
        },
        "03": {
          children: {
            "01": {
              code: "060301",
              name: "天然气管网",
              remark: "动能"
            },
            "02": {
              code: "060302",
              name: "二氧化碳管网",
              remark: "动能"
            },
            "03": {
              code: "060303",
              name: "氧气管网",
              remark: "动能"
            },
            "04": {
              code: "060304",
              name: "压缩空气管网",
              remark: "动能"
            },
            "05": {
              code: "060305",
              name: "消防管网",
              remark: "动能"
            },
            "07": {
              code: "060307",
              name: "生活水管网",
              remark: "动能"
            },
            "08": {
              code: "060308",
              name: "冷热水管网",
              remark: "动能"
            },
            "10": {
              code: "060310",
              name: "污水管网",
              remark: "动能"
            },
            "11": {
              code: "060311",
              name: "海水管网",
              remark: "动能"
            }
          },
          name: "动能管网"
        },
        "04": {
          children: {
            "01": {
              code: "060401",
              name: "消防及排烟系统",
              remark: "动能"
            },
            "02": {
              code: "060402",
              name: "消防设备1",
              remark: "动能"
            },
            "03": {
              code: "060403",
              name: "消防设备2",
              remark: "动能"
            }
          },
          name: "消防设备"
        },
        "10": {
          children: {
            "01": {
              code: "061001",
              name: "暖通空调系统",
              remark: "动能"
            },
            "02": {
              code: "061002",
              name: "海水排水系统",
              remark: "动能"
            },
            "03": {
              code: "061003",
              name: "生产水/压载水系统",
              remark: "动能"
            }
          },
          name: "其它管网设施"
        }
      },
      name: "动能设备"
    },
    "07": {
      children: {
        "01": {
          children: {
            "01": {
              code: "070101",
              name: "电动液压试压泵",
              remark: "通用"
            }
          },
          name: "液压试验设备"
        },
        "02": {
          children: {
            "01": {
              code: "070201",
              name: "移动负荷站",
              remark: "电气"
            }
          },
          name: "电器试验设备"
        },
        "03": {
          children: {
            "01": {
              code: "070301",
              name: "电动试压泵",
              remark: "通用"
            }
          },
          name: "压力试验设备"
        },
        "04": {
          children: {
            "01": {
              code: "070401",
              name: "地磅",
              remark: "通用"
            }
          },
          name: "平衡试验设备"
        }
      },
      name: "试验设备"
    },
    "08": {
      children: {
        "01": {
          children: {
            "01": {
              code: "080101",
              name: "钢材预处理产线",
              remark: "通用"
            },
            "02": {
              code: "080102",
              name: "型材自动生产线",
              remark: "通用"
            },
            "03": {
              code: "080103",
              name: "平面分段流水线",
              remark: "通用"
            },
            "04": {
              code: "080104",
              name: "管子加工流水线",
              remark: "通用"
            },
            "05": {
              code: "080105",
              name: "拼板流水生产线",
              remark: "通用"
            },
            "06": {
              code: "080106",
              name: "自动切割分拣线",
              remark: "通用"
            },
            "07": {
              code: "080107",
              name: "小组立流水线",
              remark: "通用"
            },
            "08": {
              code: "080108",
              name: "部件装焊生产线",
              remark: "通用"
            },
            "09": {
              code: "080109",
              name: "数字化车间产线",
              remark: "通用"
            },
            "10": {
              code: "080110",
              name: "条材自动打磨生产线",
              remark: "通用"
            },
            "11": {
              code: "080111",
              name: "管法兰生产线",
              remark: "通用"
            },
            "12": {
              code: "080112",
              name: "HIVAS拼板设备",
              remark: "通用"
            },
            "13": {
              code: "080113",
              name: "热镀锌生产线",
              remark: "通用"
            },
            "14": {
              code: "080114",
              name: "酸洗磷化生产线",
              remark: "通用"
            }
          },
          name: "产线设备"
        },
        "02": {
          children: {
            "01": {
              code: "080201",
              name: "舵叶安装工作车",
              remark: "通用"
            },
            "02": {
              code: "080202",
              name: "螺旋桨安装工作车",
              remark: "通用"
            },
            "03": {
              code: "080203",
              name: "三维顶升装置",
              remark: "通用"
            }
          },
          name: "搭载装置"
        },
        "03": {
          children: {
            "01": {
              code: "080301",
              name: "护舷",
              remark: "通用"
            },
            "02": {
              code: "080302",
              name: "漂浮护舷",
              remark: "通用"
            },
            "03": {
              code: "080303",
              name: "缆桩",
              remark: "通用"
            }
          },
          name: "码头装置"
        },
        "04": {
          children: {
            "01": {
              code: "080401",
              name: "电动伸缩门",
              remark: "通用"
            },
            "02": {
              code: "080402",
              name: "卷帘门",
              remark: "通用"
            },
            "03": {
              code: "080403",
              name: "电动拉门",
              remark: "通用"
            }
          },
          name: "大门"
        },
        "05": {
          children: {
            "01": {
              code: "080501",
              name: "支撑胎架",
              remark: "通用"
            },
            "02": {
              code: "080502",
              name: "胎芯",
              remark: "通用"
            }
          },
          name: "工装"
        },
        "10": {
          children: {
            "01": {
              code: "081001",
              name: "蜂窝定盘",
              remark: "通用"
            },
            "02": {
              code: "081002",
              name: "移动风雨棚",
              remark: "通用"
            }
          },
          name: "其它专用设备"
        }
      },
      name: "专用设备"
    },
    "09": {
      children: {
        "01": {
          children: {
            "01": {
              code: "090101",
              name: "喷砂装置",
              remark: "通用"
            },
            "02": {
              code: "090102",
              name: "真空吸砂装置",
              remark: "通用"
            },
            "03": {
              code: "090103",
              name: "斗提装置",
              remark: "通用"
            },
            "04": {
              code: "090104",
              name: "喷砂控制系统",
              remark: "通用"
            },
            "05": {
              code: "090105",
              name: "吸砂罐",
              remark: "通用"
            },
            "06": {
              code: "090106",
              name: "高频打磨机组套",
              remark: "通用"
            }
          },
          name: "喷砂设备"
        },
        "02": {
          children: {
            "01": {
              code: "090201",
              name: "加热除湿系统",
              remark: "通用"
            },
            "02": {
              code: "090202",
              name: "加热除湿系统",
              remark: "通用"
            },
            "03": {
              code: "090203",
              name: "除湿机",
              remark: "通用"
            },
            "04": {
              code: "090204",
              name: "加温机",
              remark: "通用"
            },
            "05": {
              code: "090205",
              name: "喷气泵",
              remark: "通用"
            },
            "06": {
              code: "090206",
              name: "清洗机",
              remark: "通用"
            }
          },
          name: "喷涂设备"
        },
        "03": {
          children: {
            "01": {
              code: "090301",
              name: "除尘装置",
              remark: "通用"
            },
            "02": {
              code: "090302",
              name: "RTO系统",
              remark: "通用"
            }
          },
          name: "环保设备"
        }
      },
      name: "涂装设备"
    },
    "10": {
      children: {
        "01": {
          children: {
            "01": {
              code: "100101",
              name: "电动扳手",
              remark: "焊机"
            },
            "02": {
              code: "100102",
              name: "砂轮切断机",
              remark: "焊机"
            },
            "03": {
              code: "100103",
              name: "管子切断机",
              remark: "焊机"
            },
            "04": {
              code: "100104",
              name: "管子切断机",
              remark: "焊机"
            },
            "05": {
              code: "100105",
              name: "角磨机",
              remark: "焊机"
            },
            "06": {
              code: "100106",
              name: "手电钻",
              remark: "焊机"
            }
          },
          name: "电动工具"
        },
        "02": {
          children: {
            "01": {
              code: "100201",
              name: "风动扳手",
              remark: "焊机"
            },
            "02": {
              code: "100202",
              name: "气弹枪",
              remark: "焊机"
            },
            "03": {
              code: "100203",
              name: "气动冲击扳手",
              remark: "焊机"
            },
            "04": {
              code: "100204",
              name: "气动角磨机",
              remark: "焊机"
            },
            "05": {
              code: "100205",
              name: "气动拉铆枪",
              remark: "焊机"
            },
            "06": {
              code: "100206",
              name: "气动平面砂磨机",
              remark: "焊机"
            }
          },
          name: "气动工具"
        },
        "03": {
          children: {
            "01": {
              code: "100301",
              name: "万用割炬",
              remark: "焊机"
            },
            "02": {
              code: "100302",
              name: "电缆压接钳",
              remark: "焊机"
            },
            "03": {
              code: "100303",
              name: "电液挤压器",
              remark: "焊机"
            }
          },
          name: "切割工具"
        },
        "04": {
          children: {
            "01": {
              code: "100401",
              name: "拔轮器",
              remark: "焊机"
            },
            "02": {
              code: "100402",
              name: "液压扳手",
              remark: "焊机"
            },
            "03": {
              code: "100403",
              name: "液压电缆切割机",
              remark: "焊机"
            },
            "04": {
              code: "100404",
              name: "液压试压泵",
              remark: "焊机"
            },
            "05": {
              code: "100405",
              name: "电缆压接钳",
              remark: "焊机"
            },
            "06": {
              code: "100406",
              name: "液压弯管机",
              remark: "焊机"
            }
          },
          name: "液力工具"
        },
        "05": {
          children: {
            "01": {
              code: "100501",
              name: "磁座钻",
              remark: "焊机"
            },
            "02": {
              code: "100502",
              name: "电缆压接钳",
              remark: "焊机"
            },
            "03": {
              code: "100503",
              name: "磁力焊接定位器",
              remark: "焊机"
            },
            "04": {
              code: "100504",
              name: "磁力起重吸盘",
              remark: "焊机"
            },
            "05": {
              code: "100505",
              name: "磁力清渣器",
              remark: "焊机"
            },
            "06": {
              code: "100506",
              name: "V 型磁力焊接固定器",
              remark: "焊机"
            }
          },
          name: "磁力工具"
        },
        "06": {
          children: {
            "01": {
              code: "100601",
              name: "台虎钳",
              remark: "焊机"
            },
            "02": {
              code: "100602",
              name: "手动冷压钳",
              remark: "焊机"
            },
            "03": {
              code: "100603",
              name: "手动电缆钳",
              remark: "焊机"
            },
            "04": {
              code: "100604",
              name: "手动管子割刀",
              remark: "焊机"
            },
            "05": {
              code: "100605",
              name: "重型链条管钳",
              remark: "焊机"
            },
            "06": {
              code: "100606",
              name: "手动弯管器",
              remark: "焊机"
            }
          },
          name: "机械工具"
        }
      },
      name: "工具设备"
    }
  };

const TYPE_CODE_MAP = {
    "HIVAS拼板设备": "080112",
    "RTO系统": "090302",
    "T型材冷弯机": "010404",
    "V 型磁力焊接固定器": "100506",
    "万用割炬": "100301",
    "万能磨床": "000405",
    "万能钻床": "000505",
    "万能铣床": "000204",
    "三维顶升装置": "080203",
    "三轮电动车": "030312",
    "三辊卷板机": "010502",
    "丝杆磨床": "000708",
    "丝杆车床": "000702",
    "丝锥磨床": "000707",
    "两轮电动车": "030313",
    "中巴": "030202",
    "二氧化碳供气系统-储罐": "060203",
    "二氧化碳供气系统-汽化器": "060204",
    "二氧化碳管网": "060302",
    "交直流电源柜": "050205",
    "仪表铣床": "000201",
    "仿形刨床": "000303",
    "仿形车床": "000103",
    "仿形铣床": "000206",
    "低压开关柜": "050202",
    "低压电容器": "050203",
    "低压电缆": "050305",
    "低压输电线路": "050302",
    "低压配电柜": "050201",
    "倒棱机": "010702",
    "其他辅助设备设施": "060207",
    "其它刨床": "000310",
    "其它加工中心": "000810",
    "其它拉床": "000330",
    "其它插床": "000320",
    "其它特种机床": "000920",
    "其它电加工机床": "000910",
    "其它磨床": "000499",
    "其它组合机床": "000820",
    "其它车床": "000199",
    "其它钻床": "000510",
    "其它镗床": "000520",
    "内园磨床": "000402",
    "冲压液压机": "010106",
    "冲孔机": "010703",
    "冷冻水系统": "060104",
    "冷热水管网": "060308",
    "切料车床": "000106",
    "刨边机床": "000304",
    "刨齿机": "000606",
    "剃齿机": "000604",
    "加工中心": "000801",
    "加温机": "090204",
    "加热除湿系统": "090202",
    "动力配电箱": "050211",
    "半自动火焰切割机": "040404",
    "半门式起重机": "020104",
    "单柱液压机": "010103",
    "卡管机": "010705",
    "卧式拉床": "000322",
    "卧式液压机": "010101",
    "卧式钻床": "000502",
    "卧式铣床": "000202",
    "卧式镗床": "000511",
    "印字划线机": "040502",
    "卷帘门": "080402",
    "卷扬机": "020201",
    "卷板机": "010501",
    "卷筒机": "010504",
    "厂房照明系统": "050501",
    "压箍机": "010706",
    "压缩空气管网": "060304",
    "叉车": "030101",
    "双柱液压机": "010104",
    "台式钻床": "000503",
    "台虎钳": "100601",
    "同步发电机": "050401",
    "吸砂罐": "090105",
    "喷气泵": "090205",
    "喷砂控制系统": "090104",
    "喷砂装置": "090101",
    "四柱液压机": "010105",
    "四辊卷板机": "010503",
    "地磅": "070401",
    "型材剪切机": "010302",
    "型材校直机": "010601",
    "型材自动生产线": "080102",
    "埋弧焊机": "040102",
    "塔式起重机": "020108",
    "外园磨床": "000404",
    "大客车": "030201",
    "天然气供气系统-储罐": "060201",
    "天然气供气系统-汽化器": "060202",
    "天然气管网": "060301",
    "导缆拖车": "020204",
    "导轨磨床": "000406",
    "封闭母线": "050309",
    "小客车": "030204",
    "小组立流水线": "080107",
    "履带起重机": "020110",
    "通用门式起重机": "020107",
    "工具铣床": "000205",
    "工程船": "030403",
    "干燥机": "060102",
    "平板车": "030111",
    "平面分段流水线": "080103",
    "平面磨床": "000401",
    "引船机": "020203",
    "弯板机": "010401",
    "弯管机": "010403",
    "循环水系统": "060103",
    "悬臂起重机": "020109",
    "手动冷压钳": "100602",
    "手动弯管器": "100606",
    "手动电缆钳": "100603",
    "手动管子割刀": "100604",
    "手电钻": "100106",
    "扩管机": "010704",
    "折边机": "010402",
    "护舷": "080301",
    "拔轮器": "100401",
    "拖轮": "030401",
    "拼板流水生产线": "080105",
    "挂车": "030110",
    "挤压液压机": "010107",
    "探照灯": "050502",
    "控制台": "050208",
    "插床": "000311",
    "插齿机": "000602",
    "摇臂钻床": "000504",
    "摩托艇": "030404",
    "摩托车": "030207",
    "摩擦压力机": "010201",
    "支撑胎架": "080501",
    "救护车": "030311",
    "数字化车间产线": "080109",
    "数控刨床": "000305",
    "数控弯曲机": "010406",
    "数控磨床": "000408",
    "数控车床": "000107",
    "数控钻床": "000506",
    "数控铣床": "000209",
    "数控镗床": "000514",
    "数控齿轮加工机床": "000607",
    "斗提装置": "090103",
    "施工升降机": "020401",
    "旋压机": "010701",
    "无动力平车": "030107",
    "无心磨床": "000403",
    "普通车床": "000101",
    "暖通空调系统": "061001",
    "曲线剪切机": "010303",
    "条材自动打磨生产线": "080110",
    "板料校平机": "010603",
    "板材剪切机": "010301",
    "板边坡口机": "001002",
    "通用桥式起重机": "020101",
    "梁式起重机（葫芦）": "020102",
    "棒料剪断机": "010304",
    "气动冲击扳手": "100203",
    "气动平面砂磨机": "100206",
    "气动拉铆枪": "100205",
    "气动角磨机": "100204",
    "气弹枪": "100202",
    "氧气供气系统-储罐": "060205",
    "氧气供气系统-汽化器": "060206",
    "氧气管网": "060303",
    "氩弧焊机": "040103",
    "污水管网": "060310",
    "汽车起重机": "020111",
    "洒水车": "030310",
    "浮船坞": "030405",
    "海水排水系统": "061002",
    "海水管网": "060311",
    "消防及排烟系统": "060401",
    "消防管网": "060305",
    "消防设备1": "060402",
    "消防设备2": "060403",
    "消防车": "030308",
    "涡杆磨床": "000706",
    "涡杆铣床": "000704",
    "液压单元": "010801",
    "液压弯管机": "100406",
    "液压扳手": "100402",
    "液压油缸": "010802",
    "液压电缆切割机": "100403",
    "液压试压泵": "100404",
    "清洗机": "090206",
    "滑移装载机": "030102",
    "滚动剪切机": "010307",
    "滚齿机": "000601",
    "漂浮护舷": "080302",
    "激光切割机": "040402",
    "空气等离子切割机": "040403",
    "焊剂烘干机": "040203",
    "热镀锌生产线": "080113",
    "焊剂烘干箱": "040202",
    "焊接机器人": "040303",
    "照明灯": "050503",
    "照明线路": "050308",
    "牛头刨床": "000302",
    "牵引车": "030109",
    "珩齿机": "000605",
    "生产水/压载水系统": "061003",
    "生活水管网": "060307",
    "电力变压器": "050101",
    "电加工机床": "000901",
    "电动伸缩门": "080401",
    "电动卷扬机": "020202",
    "电动吊篮": "020405",
    "电动平车": "030106",
    "电动扳手": "100101",
    "电动拉门": "080403",
    "电动液压试压泵": "070101",
    "电动试压泵": "070301",
    "电容柜": "050209",
    "电液挤压器": "100303",
    "电缆压接钳": "100502",
    "电讯电缆": "050306",
    "电讯输电线路": "050303",
    "登船梯（塔）": "020304",
    "皮卡车": "030205",
    "二氧焊机": "040104",
    "直流电源屏": "050210",
    "真空吸砂装置": "090102",
    "砂轮切断机": "100102",
    "磁力清渣器": "100505",
    "磁力焊接定位器": "100503",
    "磁力起重吸盘": "100504",
    "磁座钻": "100501",
    "移动负荷站": "070201",
    "移动风雨棚": "081002",
    "空压机": "060101",
    "立式拉床": "000321",
    "立式液压机": "010102",
    "立式车床": "000105",
    "立式钻床": "000501",
    "立式铣床": "000203",
    "立式镗床": "000512",
    "端面铣床": "000208",
    "等离子切割机": "040401",
    "简易升降机": "020402",
    "管子切断机": "100104",
    "管子加工流水线": "080104",
    "管子坡口机": "001001",
    "管子螺纹机": "000709",
    "管材校直机": "010602",
    "管法兰生产线": "080111",
    "箱式变电站": "050110",
    "组合机床": "000811",
    "缆桩": "080303",
    "翻斗车": "030104",
    "联合冲剪机": "010305",
    "联络柜": "050207",
    "肋骨冷弯机": "010405",
    "胎芯": "080502",
    "自动切割分拣线": "080106",
    "自动扶梯": "020303",
    "自动焊小车": "040201",
    "多头焊接装置": "040301",
    "自动车床": "000102",
    "舵叶安装工作车": "080201",
    "落地车床": "000104",
    "落地镗床": "000513",
    "蜂窝定盘": "081001",
    "螺旋压力机": "010202",
    "螺旋桨安装工作车": "080202",
    "螺纹磨床": "000705",
    "螺纹车床": "000701",
    "螺纹铣床": "000703",
    "补偿柜": "050204",
    "角磨机": "100105",
    "警车": "030309",
    "路灯": "050505",
    "载人电梯": "020302",
    "载货卡车": "030108",
    "载货电梯": "020301",
    "轿车": "030206",
    "运输辊道": "030501",
    "进线柜": "050206",
    "部件装焊生产线": "080108",
    "酸洗磷化生产线": "080114",
    "重型链条管钳": "100605",
    "钢材预处理产线": "080101",
    "铣齿机": "000603",
    "铲车": "030103",
    "门座起重机": "020106",
    "门式起重机": "020103",
    "除尘装置": "090301",
    "除湿机": "090203",
    "震动剪切床": "010308",
    "面包车": "030203",
    "顶升装置": "010803",
    "风动扳手": "100201",
    "驳船": "030402",
    "高压互感器": "050102",
    "高压接地开关": "050108",
    "高压断路器": "050105",
    "高压电容器": "050103",
    "高压电抗器": "050104",
    "高压电缆": "050304",
    "高压负荷开关": "050106",
    "高压输电线路": "050301",
    "高压配电柜": "050109",
    "高压隔离开关": "050107",
    "高杆灯": "050504",
    "高空作业车": "020403",
    "高频打磨机组套": "090106",
    "龙门刨床": "000301",
    "龙门剪切床": "010306",
    "龙门磨床": "000407",
    "龙门自动焊压梁机": "040302",
    "龙门起重机": "020105",
    "龙门铣床": "000207"
  };

const TYPE_UNIT_MAP = {};
const TYPE_PURPOSE_MAP = {};

const DEPT_CODE_MAP = {
    "人事部": "1000",
    "仓库": "0500",
    "企管部": "7100",
    "信息中心": "0800",
    "关务部": "2100",
    "分段一部": "1600",
    "分段三部": "6800",
    "分段二部": "5800",
    "制造技术部": "9700",
    "加工一部": "2500",
    "加工二部": "5900",
    "品管部": "1400",
    "售后服务部": "8500",
    "商务二部": "6600",
    "商务部": "1300",
    "土建部": "0900",
    "基础管理": "2600",
    "外协管理部": "2700",
    "大连国际船舶设计中心": "7600",
    "安环部": "1100",
    "宿管办": "3200",
    "对外联络办": "2800",
    "居装一部": "7700",
    "居装二部": "6700",
    "工法部": "5000",
    "工程仓库": "8400",
    "工程公司安全管理部": "8800",
    "工程公司成本核算部": "9000",
    "工程公司机装部": "9300",
    "工程公司生产计划部": "9200",
    "工程公司精度部": "A100",
    "工程公司综合管理部": "8900",
    "工程公司船体部": "9500",
    "工程公司船装部": "A200",
    "工程公司舾装部": "9100",
    "工程公司调试部": "9400",
    "工程部": "7400",
    "总经办": "0100",
    "总装一部": "1800",
    "总装三部": "7800",
    "总装二部": "6200",
    "总装四部": "9800",
    "恒力造船水稳料现场": "9900",
    "新闻宣传部": "7000",
    "水运部": "7500",
    "法务部": "0600",
    "涂装一部": "1700",
    "涂装二部": "9600",
    "生产保障部": "2200",
    "生产管理部": "1900",
    "电装调试部": "6900",
    "研发部": "7300",
    "管舾部": "6300",
    "精度部": "2300",
    "船舶设计研究中心": "1500",
    "行政部": "0700",
    "装备制造部": "5700",
    "财务管理部": "0200",
    "资金管理部": "2900",
    "造船-上海虹桥分公司": "8600",
    "造船-南通分公司": "8700",
    "造船安环部": "1200",
    "采购一部": "0300",
    "采购二部": "0400",
    "铁舾部": "6400",
    "镀锌车间": "6500",
    "项目部": "2400"
  };

const WORKSHOP_CODE_MAP = {
    "人事部": "1000",
    "人事部-人事": "1001",
    "仓库": "0500",
    "企管部": "7100",
    "信息中心": "0800",
    "关务部": "2100",
    "分段一部": "1600",
    "分段一部-先行舾装车间": "1613",
    "分段一部-分段一车间": "1604",
    "分段一部-分段三车间": "1607",
    "分段一部-分段二车间": "1605",
    "分段一部-分段四车间": "1608",
    "分段一部-平组车间": "1602",
    "分段一部-支援车间": "1612",
    "分段一部-曲组三车间": "1614",
    "分段一部-曲组五车间": "1616",
    "分段一部-曲组四车间": "1615",
    "分段一部-曲组车间": "1603",
    "分段一部-综合管理室": "1601",
    "分段三部": "6800",
    "分段三部-先行舾装": "6803",
    "分段三部-平组内业车间": "6801",
    "分段三部-平组外业车间": "6802",
    "分段三部-支援车间": "6805",
    "分段三部-综合管理室": "6804",
    "分段二部": "5800",
    "分段二部-先行舾装车间": "5806",
    "分段二部-平组车间": "5804",
    "分段二部-曲组一车间": "5805",
    "分段二部-曲组三车间": "5801",
    "分段二部-曲组二车间": "5802",
    "分段二部-综合管理室": "5803",
    "制造技术部": "9700",
    "制造技术部-先行脚手支援室": "9707",
    "制造技术部-分段精控一室": "9703",
    "制造技术部-分段精控二室": "9704",
    "制造技术部-加工精控一室": "9705",
    "制造技术部-加工精控二室": "9706",
    "制造技术部-总装精控一室": "9701",
    "制造技术部-总装精控二室": "9702",
    "制造技术部-生产技术室": "9708",
    "加工一部": "2500",
    "加工一部-组立车间": "2504",
    "加工一部-综合管理室": "2503",
    "加工一部-钢加车间": "2502",
    "加工二部": "5900",
    "加工二部-准备车间": "5903",
    "加工二部-组立车间": "5901",
    "加工二部-综合管理室": "5904",
    "加工二部-钢加车间": "5902",
    "品管部": "1400",
    "品管部-售后服务室": "1403",
    "品管部-无损检测室": "1404",
    "品管部-机电检查一室": "1402",
    "品管部-机电检查二室": "1408",
    "品管部-焊接管理室": "1410",
    "品管部-物资检验室": "1406",
    "品管部-船体检查一室": "1401",
    "品管部-船体检查二室": "1409",
    "品管部-计量理化实验中心": "1407",
    "品管部-质量管理室": "1405",
    "售后服务部": "8500",
    "商务二部": "6600",
    "商务部": "1300",
    "土建部": "0900",
    "基础管理": "2600",
    "基础管理-6S": "2603",
    "基础管理-三供车间": "2607",
    "基础管理-准备车间": "2602",
    "基础管理-基础管理车间": "2601",
    "基础管理-水运车间": "2606",
    "基础管理-环卫": "2604",
    "基础管理-维保车间": "2605",
    "外协管理部": "2700",
    "外协管理部-劳务管理室": "2702",
    "外协管理部-委外加工室": "2701",
    "外协管理部-成本室": "2704",
    "外协管理部-数据管理室": "2705",
    "外协管理部-计价室": "2703",
    "大连国际船舶设计中心": "7600",
    "安环部": "1100",
    "安环部-保安": "1101",
    "安环部-安环": "1102",
    "安环部-消防": "1103",
    "宿管办": "3200",
    "对外联络办": "2800",
    "居装一部": "7700",
    "居装一部-分段车间": "7704",
    "居装一部-居装车间": "7702",
    "居装一部-总组车间": "7701",
    "居装一部-综合管理室": "7703",
    "居装二部": "6700",
    "居装二部-分段车间": "6703",
    "居装二部-居装车间": "6705",
    "居装二部-总组车间": "6702",
    "居装二部-综合管理室": "6701",
    "工法部": "5000",
    "工法部-工艺室": "5003",
    "工法部-焊接室": "5004",
    "工法部-综合管理室": "5001",
    "工法部-起运室": "5002",
    "工程仓库": "8400",
    "工程公司安全管理部": "8800",
    "工程公司成本核算部": "9000",
    "工程公司机装部": "9300",
    "工程公司机装部-机装一车间": "9301",
    "工程公司机装部-机装三车间": "9303",
    "工程公司机装部-机装二车间": "9302",
    "工程公司机装部-机装四车间": "9304",
    "工程公司生产计划部": "9200",
    "工程公司生产计划部-支援车间": "9206",
    "工程公司生产计划部-机装管理室": "9203",
    "工程公司生产计划部-材料组": "9201",
    "工程公司生产计划部-涂装管理室": "9204",
    "工程公司生产计划部-电装管理室": "9202",
    "工程公司生产计划部-船体管理室": "9205",
    "工程公司生产计划部-船装管理室": "9207",
    "工程公司精度部": "A100",
    "工程公司精度部-定位车间": "A102",
    "工程公司精度部-精度车间": "A101",
    "工程公司综合管理部": "8900",
    "工程公司船体部": "9500",
    "工程公司船体部-船体一车间": "9501",
    "工程公司船体部-船体七车间": "9507",
    "工程公司船体部-船体三车间": "9503",
    "工程公司船体部-船体二车间": "9502",
    "工程公司船体部-船体五车间": "9505",
    "工程公司船体部-船体八车间": "9508",
    "工程公司船体部-船体六车间": "9506",
    "工程公司船体部-船体四车间": "9504",
    "工程公司船装部": "A200",
    "工程公司船装部-涂装一车间": "A203",
    "工程公司船装部-涂装二车间": "A204",
    "工程公司船装部-船装一车间": "A201",
    "工程公司船装部-船装二车间": "A202",
    "工程公司舾装部": "9100",
    "工程公司舾装部-舾装一车间": "9101",
    "工程公司舾装部-舾装七车间": "9107",
    "工程公司舾装部-舾装三车间": "9103",
    "工程公司舾装部-舾装二车间": "9102",
    "工程公司舾装部-舾装五车间": "9105",
    "工程公司舾装部-舾装六车间": "9106",
    "工程公司舾装部-舾装四车间": "9104",
    "工程公司调试部": "9400",
    "工程公司调试部-调试一车间": "9401",
    "工程公司调试部-调试三车间": "9403",
    "工程公司调试部-调试二车间": "9402",
    "工程公司调试部-调试四车间": "9404",
    "工程部": "7400",
    "工程部-材料组": "7401",
    "总经办": "0100",
    "总装一部": "1800",
    "总装一部-作业车间": "1811",
    "总装一部-安装中心": "1809",
    "总装一部-居装车间": "1807",
    "总装一部-工程计划室": "1812",
    "总装一部-支援车间": "1806",
    "总装一部-机装车间": "1803",
    "总装一部-涂装车间": "1810",
    "总装一部-电装车间": "1805",
    "总装一部-综合管理室": "1801",
    "总装一部-船体车间": "1802",
    "总装一部-船装车间": "1808",
    "总装一部-调试中心": "1804",
    "总装三部": "7800",
    "总装三部-工程计划一室": "7813",
    "总装三部-工程计划二室": "7814",
    "总装三部-支援一车间": "7802",
    "总装三部-支援二车间": "7808",
    "总装三部-机装一车间": "7805",
    "总装三部-机装二车间": "7811",
    "总装三部-涂装一车间": "7801",
    "总装三部-涂装二车间": "7807",
    "总装三部-精度管理一室": "7815",
    "总装三部-精度管理二室": "7816",
    "总装三部-综合管理一室": "7806",
    "总装三部-综合管理二室": "7812",
    "总装三部-船体一车间": "7803",
    "总装三部-船体二车间": "7809",
    "总装三部-船装一车间": "7804",
    "总装三部-船装二车间": "7810",
    "总装三部-质量工艺一室": "7817",
    "总装三部-质量工艺二室": "7818",
    "总装二部": "6200",
    "总装二部-支援车间": "6207",
    "总装二部-机装车间": "6203",
    "总装二部-涂装车间": "6208",
    "总装二部-电装车间": "6205",
    "总装二部-综合管理室": "6201",
    "总装二部-船体车间": "6202",
    "总装二部-船装车间": "6206",
    "总装二部-调试中心": "6204",
    "总装四部": "9800",
    "总装四部-支援车间": "9806",
    "总装四部-机装车间": "9805",
    "总装四部-涂装车间": "9804",
    "总装四部-综合管理室": "9803",
    "总装四部-船体车间": "9802",
    "总装四部-船装车间": "9801",
    "恒力造船水稳料现场": "9900",
    "新闻宣传部": "7000",
    "水运部": "7500",
    "水运部-综合管理室": "7504",
    "水运部-船台车间": "7503",
    "水运部-船坞一车间": "7501",
    "水运部-船坞二车间": "7502",
    "法务部": "0600",
    "涂装一部": "1700",
    "涂装二部": "9600",
    "生产保障部": "2200",
    "生产保障部-动能管理室": "2201",
    "生产保障部-焊机工具一室": "2202",
    "生产保障部-焊机工具二室": "2212",
    "生产保障部-综合管理室": "2205",
    "生产保障部-起重设备一室": "2203",
    "生产保障部-起重设备二室": "2214",
    "生产保障部-通用设备一室": "2204",
    "生产保障部-通用设备二室": "2213",
    "生产管理部": "1900",
    "生产管理部-生产支援室": "1903",
    "生产管理部-生产计划室": "1901",
    "生产管理部-码头调度室": "1904",
    "生产管理部-项目管理室": "1902",
    "电装调试部": "6900",
    "电装调试部-电装一车间": "6901",
    "电装调试部-电装二车间": "6902",
    "电装调试部-综合管理室": "6905",
    "电装调试部-调试一车间": "6903",
    "电装调试部-调试二车间": "6904",
    "研发部": "7300",
    "管舾部": "6300",
    "精度部": "2300",
    "精度部-生产技术室": "2301",
    "船舶设计研究中心": "1500",
    "船舶设计研究中心-上海分部": "1510",
    "船舶设计研究中心-居装室": "1508",
    "船舶设计研究中心-总体室": "1507",
    "船舶设计研究中心-机装室": "1506",
    "船舶设计研究中心-海工室": "1502",
    "船舶设计研究中心-电装室": "1505",
    "船舶设计研究中心-综合室": "1501",
    "船舶设计研究中心-船体室": "1504",
    "船舶设计研究中心-船装室": "1503",
    "行政部": "0700",
    "行政部-办公室": "0703",
    "行政部-接待餐厅": "0706",
    "行政部-车队": "0701",
    "行政部-迎宾馆": "0702",
    "装备制造部": "5700",
    "装备制造部-综合管理室": "5701",
    "装备制造部-绿色能源一车间": "5703",
    "装备制造部-绿色能源二车间": "5704",
    "装备制造部-船配一车间": "5702",
    "财务管理部": "0200",
    "资金管理部": "2900",
    "造船-上海虹桥分公司": "8600",
    "造船-上海虹桥分公司-人事部-上海": "8610",
    "造船-上海虹桥分公司-商务部二部-上海": "8606",
    "造船-上海虹桥分公司-居装室-上海": "8608",
    "造船-上海虹桥分公司-总体室-上海": "8607",
    "造船-上海虹桥分公司-总经办-上海": "8601",
    "造船-上海虹桥分公司-机装室-上海": "8602",
    "造船-上海虹桥分公司-电装室-上海": "8605",
    "造船-上海虹桥分公司-船体室-上海": "8603",
    "造船-上海虹桥分公司-舾装室-上海": "8609",
    "造船-上海虹桥分公司-行政部-上海": "8604",
    "造船-南通分公司": "8700",
    "造船-南通分公司-人事部-南通": "8702",
    "造船-南通分公司-居装室-南通": "8703",
    "造船-南通分公司-机装室-南通": "8704",
    "造船-南通分公司-电装室-南通": "8707",
    "造船-南通分公司-船体室-南通": "8705",
    "造船-南通分公司-船装室-南通": "8706",
    "造船-南通分公司-行政部-南通": "8701",
    "造船安环部": "1200",
    "采购一部": "0300",
    "采购二部": "0400",
    "铁舾部": "6400",
    "镀锌车间": "6500",
    "项目部": "2400"
  };

const DEPT_WORKSHOP_TREE = {
    "人事部": {
      code: "1000",
      workshops: {
        "1001": {
          code: "1001",
          name: "人事部-人事"
        }
      }
    },
    "仓库": {
      code: "0500",
      workshops: {
        "0500": {
          code: "0500",
          name: "仓库"
        }
      }
    },
    "企管部": {
      code: "7100",
      workshops: {
        "7100": {
          code: "7100",
          name: "企管部"
        }
      }
    },
    "信息中心": {
      code: "0800",
      workshops: {
        "0800": {
          code: "0800",
          name: "信息中心"
        }
      }
    },
    "关务部": {
      code: "2100",
      workshops: {
        "2100": {
          code: "2100",
          name: "关务部"
        }
      }
    },
    "分段一部": {
      code: "1600",
      workshops: {
        "1601": {
          code: "1601",
          name: "分段一部-综合管理室"
        },
        "1602": {
          code: "1602",
          name: "分段一部-平组车间"
        },
        "1603": {
          code: "1603",
          name: "分段一部-曲组车间"
        },
        "1604": {
          code: "1604",
          name: "分段一部-分段一车间"
        },
        "1605": {
          code: "1605",
          name: "分段一部-分段二车间"
        },
        "1607": {
          code: "1607",
          name: "分段一部-分段三车间"
        },
        "1608": {
          code: "1608",
          name: "分段一部-分段四车间"
        },
        "1612": {
          code: "1612",
          name: "分段一部-支援车间"
        },
        "1613": {
          code: "1613",
          name: "分段一部-先行舾装车间"
        },
        "1614": {
          code: "1614",
          name: "分段一部-曲组三车间"
        },
        "1615": {
          code: "1615",
          name: "分段一部-曲组四车间"
        },
        "1616": {
          code: "1616",
          name: "分段一部-曲组五车间"
        }
      }
    },
    "分段三部": {
      code: "6800",
      workshops: {
        "6801": {
          code: "6801",
          name: "分段三部-平组内业车间"
        },
        "6802": {
          code: "6802",
          name: "分段三部-平组外业车间"
        },
        "6803": {
          code: "6803",
          name: "分段三部-先行舾装"
        },
        "6804": {
          code: "6804",
          name: "分段三部-综合管理室"
        },
        "6805": {
          code: "6805",
          name: "分段三部-支援车间"
        }
      }
    },
    "分段二部": {
      code: "5800",
      workshops: {
        "5801": {
          code: "5801",
          name: "分段二部-曲组三车间"
        },
        "5802": {
          code: "5802",
          name: "分段二部-曲组二车间"
        },
        "5803": {
          code: "5803",
          name: "分段二部-综合管理室"
        },
        "5804": {
          code: "5804",
          name: "分段二部-平组车间"
        },
        "5805": {
          code: "5805",
          name: "分段二部-曲组一车间"
        },
        "5806": {
          code: "5806",
          name: "分段二部-先行舾装车间"
        }
      }
    },
    "制造技术部": {
      code: "9700",
      workshops: {
        "9701": {
          code: "9701",
          name: "制造技术部-总装精控一室"
        },
        "9702": {
          code: "9702",
          name: "制造技术部-总装精控二室"
        },
        "9703": {
          code: "9703",
          name: "制造技术部-分段精控一室"
        },
        "9704": {
          code: "9704",
          name: "制造技术部-分段精控二室"
        },
        "9705": {
          code: "9705",
          name: "制造技术部-加工精控一室"
        },
        "9706": {
          code: "9706",
          name: "制造技术部-加工精控二室"
        },
        "9707": {
          code: "9707",
          name: "制造技术部-先行脚手支援室"
        },
        "9708": {
          code: "9708",
          name: "制造技术部-生产技术室"
        }
      }
    },
    "加工一部": {
      code: "2500",
      workshops: {
        "2502": {
          code: "2502",
          name: "加工一部-钢加车间"
        },
        "2503": {
          code: "2503",
          name: "加工一部-综合管理室"
        },
        "2504": {
          code: "2504",
          name: "加工一部-组立车间"
        }
      }
    },
    "加工二部": {
      code: "5900",
      workshops: {
        "5901": {
          code: "5901",
          name: "加工二部-组立车间"
        },
        "5902": {
          code: "5902",
          name: "加工二部-钢加车间"
        },
        "5903": {
          code: "5903",
          name: "加工二部-准备车间"
        },
        "5904": {
          code: "5904",
          name: "加工二部-综合管理室"
        }
      }
    },
    "品管部": {
      code: "1400",
      workshops: {
        "1401": {
          code: "1401",
          name: "品管部-船体检查一室"
        },
        "1402": {
          code: "1402",
          name: "品管部-机电检查一室"
        },
        "1403": {
          code: "1403",
          name: "品管部-售后服务室"
        },
        "1404": {
          code: "1404",
          name: "品管部-无损检测室"
        },
        "1405": {
          code: "1405",
          name: "品管部-质量管理室"
        },
        "1406": {
          code: "1406",
          name: "品管部-物资检验室"
        },
        "1407": {
          code: "1407",
          name: "品管部-计量理化实验中心"
        },
        "1408": {
          code: "1408",
          name: "品管部-机电检查二室"
        },
        "1409": {
          code: "1409",
          name: "品管部-船体检查二室"
        },
        "1410": {
          code: "1410",
          name: "品管部-焊接管理室"
        }
      }
    },
    "售后服务部": {
      code: "8500",
      workshops: {
        "8500": {
          code: "8500",
          name: "售后服务部"
        }
      }
    },
    "商务二部": {
      code: "6600",
      workshops: {
        "6600": {
          code: "6600",
          name: "商务二部"
        }
      }
    },
    "商务部": {
      code: "1300",
      workshops: {
        "1300": {
          code: "1300",
          name: "商务部"
        }
      }
    },
    "土建部": {
      code: "0900",
      workshops: {
        "0900": {
          code: "0900",
          name: "土建部"
        }
      }
    },
    "基础管理": {
      code: "2600",
      workshops: {
        "2601": {
          code: "2601",
          name: "基础管理-基础管理车间"
        },
        "2602": {
          code: "2602",
          name: "基础管理-准备车间"
        },
        "2603": {
          code: "2603",
          name: "基础管理-6S"
        },
        "2604": {
          code: "2604",
          name: "基础管理-环卫"
        },
        "2605": {
          code: "2605",
          name: "基础管理-维保车间"
        },
        "2606": {
          code: "2606",
          name: "基础管理-水运车间"
        },
        "2607": {
          code: "2607",
          name: "基础管理-三供车间"
        }
      }
    },
    "外协管理部": {
      code: "2700",
      workshops: {
        "2701": {
          code: "2701",
          name: "外协管理部-委外加工室"
        },
        "2702": {
          code: "2702",
          name: "外协管理部-劳务管理室"
        },
        "2703": {
          code: "2703",
          name: "外协管理部-计价室"
        },
        "2704": {
          code: "2704",
          name: "外协管理部-成本室"
        },
        "2705": {
          code: "2705",
          name: "外协管理部-数据管理室"
        }
      }
    },
    "大连国际船舶设计中心": {
      code: "7600",
      workshops: {
        "7600": {
          code: "7600",
          name: "大连国际船舶设计中心"
        }
      }
    },
    "安环部": {
      code: "1100",
      workshops: {
        "1101": {
          code: "1101",
          name: "安环部-保安"
        },
        "1102": {
          code: "1102",
          name: "安环部-安环"
        },
        "1103": {
          code: "1103",
          name: "安环部-消防"
        }
      }
    },
    "宿管办": {
      code: "3200",
      workshops: {
        "3200": {
          code: "3200",
          name: "宿管办"
        }
      }
    },
    "对外联络办": {
      code: "2800",
      workshops: {
        "2800": {
          code: "2800",
          name: "对外联络办"
        }
      }
    },
    "居装一部": {
      code: "7700",
      workshops: {
        "7701": {
          code: "7701",
          name: "居装一部-总组车间"
        },
        "7702": {
          code: "7702",
          name: "居装一部-居装车间"
        },
        "7703": {
          code: "7703",
          name: "居装一部-综合管理室"
        },
        "7704": {
          code: "7704",
          name: "居装一部-分段车间"
        }
      }
    },
    "居装二部": {
      code: "6700",
      workshops: {
        "6701": {
          code: "6701",
          name: "居装二部-综合管理室"
        },
        "6702": {
          code: "6702",
          name: "居装二部-总组车间"
        },
        "6703": {
          code: "6703",
          name: "居装二部-分段车间"
        },
        "6705": {
          code: "6705",
          name: "居装二部-居装车间"
        }
      }
    },
    "工法部": {
      code: "5000",
      workshops: {
        "5001": {
          code: "5001",
          name: "工法部-综合管理室"
        },
        "5002": {
          code: "5002",
          name: "工法部-起运室"
        },
        "5003": {
          code: "5003",
          name: "工法部-工艺室"
        },
        "5004": {
          code: "5004",
          name: "工法部-焊接室"
        }
      }
    },
    "工程仓库": {
      code: "8400",
      workshops: {
        "8400": {
          code: "8400",
          name: "工程仓库"
        }
      }
    },
    "工程公司安全管理部": {
      code: "8800",
      workshops: {
        "8800": {
          code: "8800",
          name: "工程公司安全管理部"
        }
      }
    },
    "工程公司成本核算部": {
      code: "9000",
      workshops: {
        "9000": {
          code: "9000",
          name: "工程公司成本核算部"
        }
      }
    },
    "工程公司机装部": {
      code: "9300",
      workshops: {
        "9301": {
          code: "9301",
          name: "工程公司机装部-机装一车间"
        },
        "9302": {
          code: "9302",
          name: "工程公司机装部-机装二车间"
        },
        "9303": {
          code: "9303",
          name: "工程公司机装部-机装三车间"
        },
        "9304": {
          code: "9304",
          name: "工程公司机装部-机装四车间"
        }
      }
    },
    "工程公司生产计划部": {
      code: "9200",
      workshops: {
        "9201": {
          code: "9201",
          name: "工程公司生产计划部-材料组"
        },
        "9202": {
          code: "9202",
          name: "工程公司生产计划部-电装管理室"
        },
        "9203": {
          code: "9203",
          name: "工程公司生产计划部-机装管理室"
        },
        "9204": {
          code: "9204",
          name: "工程公司生产计划部-涂装管理室"
        },
        "9205": {
          code: "9205",
          name: "工程公司生产计划部-船体管理室"
        },
        "9206": {
          code: "9206",
          name: "工程公司生产计划部-支援车间"
        },
        "9207": {
          code: "9207",
          name: "工程公司生产计划部-船装管理室"
        }
      }
    },
    "工程公司精度部": {
      code: "A100",
      workshops: {
        A101: {
          code: "A101",
          name: "工程公司精度部-精度车间"
        },
        A102: {
          code: "A102",
          name: "工程公司精度部-定位车间"
        }
      }
    },
    "工程公司综合管理部": {
      code: "8900",
      workshops: {
        "8900": {
          code: "8900",
          name: "工程公司综合管理部"
        }
      }
    },
    "工程公司船体部": {
      code: "9500",
      workshops: {
        "9501": {
          code: "9501",
          name: "工程公司船体部-船体一车间"
        },
        "9502": {
          code: "9502",
          name: "工程公司船体部-船体二车间"
        },
        "9503": {
          code: "9503",
          name: "工程公司船体部-船体三车间"
        },
        "9504": {
          code: "9504",
          name: "工程公司船体部-船体四车间"
        },
        "9505": {
          code: "9505",
          name: "工程公司船体部-船体五车间"
        },
        "9506": {
          code: "9506",
          name: "工程公司船体部-船体六车间"
        },
        "9507": {
          code: "9507",
          name: "工程公司船体部-船体七车间"
        },
        "9508": {
          code: "9508",
          name: "工程公司船体部-船体八车间"
        }
      }
    },
    "工程公司船装部": {
      code: "A200",
      workshops: {
        A201: {
          code: "A201",
          name: "工程公司船装部-船装一车间"
        },
        A202: {
          code: "A202",
          name: "工程公司船装部-船装二车间"
        },
        A203: {
          code: "A203",
          name: "工程公司船装部-涂装一车间"
        },
        A204: {
          code: "A204",
          name: "工程公司船装部-涂装二车间"
        }
      }
    },
    "工程公司舾装部": {
      code: "9100",
      workshops: {
        "9101": {
          code: "9101",
          name: "工程公司舾装部-舾装一车间"
        },
        "9102": {
          code: "9102",
          name: "工程公司舾装部-舾装二车间"
        },
        "9103": {
          code: "9103",
          name: "工程公司舾装部-舾装三车间"
        },
        "9104": {
          code: "9104",
          name: "工程公司舾装部-舾装四车间"
        },
        "9105": {
          code: "9105",
          name: "工程公司舾装部-舾装五车间"
        },
        "9106": {
          code: "9106",
          name: "工程公司舾装部-舾装六车间"
        },
        "9107": {
          code: "9107",
          name: "工程公司舾装部-舾装七车间"
        }
      }
    },
    "工程公司调试部": {
      code: "9400",
      workshops: {
        "9401": {
          code: "9401",
          name: "工程公司调试部-调试一车间"
        },
        "9402": {
          code: "9402",
          name: "工程公司调试部-调试二车间"
        },
        "9403": {
          code: "9403",
          name: "工程公司调试部-调试三车间"
        },
        "9404": {
          code: "9404",
          name: "工程公司调试部-调试四车间"
        }
      }
    },
    "工程部": {
      code: "7400",
      workshops: {
        "7401": {
          code: "7401",
          name: "工程部-材料组"
        }
      }
    },
    "总经办": {
      code: "0100",
      workshops: {
        "0100": {
          code: "0100",
          name: "总经办"
        }
      }
    },
    "总装一部": {
      code: "1800",
      workshops: {
        "1801": {
          code: "1801",
          name: "总装一部-综合管理室"
        },
        "1802": {
          code: "1802",
          name: "总装一部-船体车间"
        },
        "1803": {
          code: "1803",
          name: "总装一部-机装车间"
        },
        "1804": {
          code: "1804",
          name: "总装一部-调试中心"
        },
        "1805": {
          code: "1805",
          name: "总装一部-电装车间"
        },
        "1806": {
          code: "1806",
          name: "总装一部-支援车间"
        },
        "1807": {
          code: "1807",
          name: "总装一部-居装车间"
        },
        "1808": {
          code: "1808",
          name: "总装一部-船装车间"
        },
        "1809": {
          code: "1809",
          name: "总装一部-安装中心"
        },
        "1810": {
          code: "1810",
          name: "总装一部-涂装车间"
        },
        "1811": {
          code: "1811",
          name: "总装一部-作业车间"
        },
        "1812": {
          code: "1812",
          name: "总装一部-工程计划室"
        }
      }
    },
    "总装三部": {
      code: "7800",
      workshops: {
        "7801": {
          code: "7801",
          name: "总装三部-涂装一车间"
        },
        "7802": {
          code: "7802",
          name: "总装三部-支援一车间"
        },
        "7803": {
          code: "7803",
          name: "总装三部-船体一车间"
        },
        "7804": {
          code: "7804",
          name: "总装三部-船装一车间"
        },
        "7805": {
          code: "7805",
          name: "总装三部-机装一车间"
        },
        "7806": {
          code: "7806",
          name: "总装三部-综合管理一室"
        },
        "7807": {
          code: "7807",
          name: "总装三部-涂装二车间"
        },
        "7808": {
          code: "7808",
          name: "总装三部-支援二车间"
        },
        "7809": {
          code: "7809",
          name: "总装三部-船体二车间"
        },
        "7810": {
          code: "7810",
          name: "总装三部-船装二车间"
        },
        "7811": {
          code: "7811",
          name: "总装三部-机装二车间"
        },
        "7812": {
          code: "7812",
          name: "总装三部-综合管理二室"
        },
        "7813": {
          code: "7813",
          name: "总装三部-工程计划一室"
        },
        "7814": {
          code: "7814",
          name: "总装三部-工程计划二室"
        },
        "7815": {
          code: "7815",
          name: "总装三部-精度管理一室"
        },
        "7816": {
          code: "7816",
          name: "总装三部-精度管理二室"
        },
        "7817": {
          code: "7817",
          name: "总装三部-质量工艺一室"
        },
        "7818": {
          code: "7818",
          name: "总装三部-质量工艺二室"
        }
      }
    },
    "总装二部": {
      code: "6200",
      workshops: {
        "6201": {
          code: "6201",
          name: "总装二部-综合管理室"
        },
        "6202": {
          code: "6202",
          name: "总装二部-船体车间"
        },
        "6203": {
          code: "6203",
          name: "总装二部-机装车间"
        },
        "6204": {
          code: "6204",
          name: "总装二部-调试中心"
        },
        "6205": {
          code: "6205",
          name: "总装二部-电装车间"
        },
        "6206": {
          code: "6206",
          name: "总装二部-船装车间"
        },
        "6207": {
          code: "6207",
          name: "总装二部-支援车间"
        },
        "6208": {
          code: "6208",
          name: "总装二部-涂装车间"
        }
      }
    },
    "总装四部": {
      code: "9800",
      workshops: {
        "9801": {
          code: "9801",
          name: "总装四部-船装车间"
        },
        "9802": {
          code: "9802",
          name: "总装四部-船体车间"
        },
        "9803": {
          code: "9803",
          name: "总装四部-综合管理室"
        },
        "9804": {
          code: "9804",
          name: "总装四部-涂装车间"
        },
        "9805": {
          code: "9805",
          name: "总装四部-机装车间"
        },
        "9806": {
          code: "9806",
          name: "总装四部-支援车间"
        }
      }
    },
    "恒力造船水稳料现场": {
      code: "9900",
      workshops: {
        "9900": {
          code: "9900",
          name: "恒力造船水稳料现场"
        }
      }
    },
    "新闻宣传部": {
      code: "7000",
      workshops: {
        "7000": {
          code: "7000",
          name: "新闻宣传部"
        }
      }
    },
    "水运部": {
      code: "7500",
      workshops: {
        "7501": {
          code: "7501",
          name: "水运部-船坞一车间"
        },
        "7502": {
          code: "7502",
          name: "水运部-船坞二车间"
        },
        "7503": {
          code: "7503",
          name: "水运部-船台车间"
        },
        "7504": {
          code: "7504",
          name: "水运部-综合管理室"
        }
      }
    },
    "法务部": {
      code: "0600",
      workshops: {
        "0600": {
          code: "0600",
          name: "法务部"
        }
      }
    },
    "涂装一部": {
      code: "1700",
      workshops: {
        "1700": {
          code: "1700",
          name: "涂装一部"
        }
      }
    },
    "涂装二部": {
      code: "9600",
      workshops: {
        "9600": {
          code: "9600",
          name: "涂装二部"
        }
      }
    },
    "生产保障部": {
      code: "2200",
      workshops: {
        "2201": {
          code: "2201",
          name: "生产保障部-动能管理室"
        },
        "2202": {
          code: "2202",
          name: "生产保障部-焊机工具一室"
        },
        "2203": {
          code: "2203",
          name: "生产保障部-起重设备一室"
        },
        "2204": {
          code: "2204",
          name: "生产保障部-通用设备一室"
        },
        "2205": {
          code: "2205",
          name: "生产保障部-综合管理室"
        },
        "2212": {
          code: "2212",
          name: "生产保障部-焊机工具二室"
        },
        "2213": {
          code: "2213",
          name: "生产保障部-通用设备二室"
        },
        "2214": {
          code: "2214",
          name: "生产保障部-起重设备二室"
        }
      }
    },
    "生产管理部": {
      code: "1900",
      workshops: {
        "1901": {
          code: "1901",
          name: "生产管理部-生产计划室"
        },
        "1902": {
          code: "1902",
          name: "生产管理部-项目管理室"
        },
        "1903": {
          code: "1903",
          name: "生产管理部-生产支援室"
        },
        "1904": {
          code: "1904",
          name: "生产管理部-码头调度室"
        }
      }
    },
    "电装调试部": {
      code: "6900",
      workshops: {
        "6901": {
          code: "6901",
          name: "电装调试部-电装一车间"
        },
        "6902": {
          code: "6902",
          name: "电装调试部-电装二车间"
        },
        "6903": {
          code: "6903",
          name: "电装调试部-调试一车间"
        },
        "6904": {
          code: "6904",
          name: "电装调试部-调试二车间"
        },
        "6905": {
          code: "6905",
          name: "电装调试部-综合管理室"
        }
      }
    },
    "研发部": {
      code: "7300",
      workshops: {
        "7300": {
          code: "7300",
          name: "研发部"
        }
      }
    },
    "管舾部": {
      code: "6300",
      workshops: {
        "6300": {
          code: "6300",
          name: "管舾部"
        }
      }
    },
    "精度部": {
      code: "2300",
      workshops: {
        "2301": {
          code: "2301",
          name: "精度部-生产技术室"
        }
      }
    },
    "船舶设计研究中心": {
      code: "1500",
      workshops: {
        "1501": {
          code: "1501",
          name: "船舶设计研究中心-综合室"
        },
        "1502": {
          code: "1502",
          name: "船舶设计研究中心-海工室"
        },
        "1503": {
          code: "1503",
          name: "船舶设计研究中心-船装室"
        },
        "1504": {
          code: "1504",
          name: "船舶设计研究中心-船体室"
        },
        "1505": {
          code: "1505",
          name: "船舶设计研究中心-电装室"
        },
        "1506": {
          code: "1506",
          name: "船舶设计研究中心-机装室"
        },
        "1507": {
          code: "1507",
          name: "船舶设计研究中心-总体室"
        },
        "1508": {
          code: "1508",
          name: "船舶设计研究中心-居装室"
        },
        "1510": {
          code: "1510",
          name: "船舶设计研究中心-上海分部"
        }
      }
    },
    "行政部": {
      code: "0700",
      workshops: {
        "0701": {
          code: "0701",
          name: "行政部-车队"
        },
        "0702": {
          code: "0702",
          name: "行政部-迎宾馆"
        },
        "0703": {
          code: "0703",
          name: "行政部-办公室"
        },
        "0706": {
          code: "0706",
          name: "行政部-接待餐厅"
        }
      }
    },
    "装备制造部": {
      code: "5700",
      workshops: {
        "5701": {
          code: "5701",
          name: "装备制造部-综合管理室"
        },
        "5702": {
          code: "5702",
          name: "装备制造部-船配一车间"
        },
        "5703": {
          code: "5703",
          name: "装备制造部-绿色能源一车间"
        },
        "5704": {
          code: "5704",
          name: "装备制造部-绿色能源二车间"
        }
      }
    },
    "财务管理部": {
      code: "0200",
      workshops: {
        "0200": {
          code: "0200",
          name: "财务管理部"
        }
      }
    },
    "资金管理部": {
      code: "2900",
      workshops: {
        "2900": {
          code: "2900",
          name: "资金管理部"
        }
      }
    },
    "造船-上海虹桥分公司": {
      code: "8600",
      workshops: {
        "8601": {
          code: "8601",
          name: "造船-上海虹桥分公司-总经办-上海"
        },
        "8602": {
          code: "8602",
          name: "造船-上海虹桥分公司-机装室-上海"
        },
        "8603": {
          code: "8603",
          name: "造船-上海虹桥分公司-船体室-上海"
        },
        "8604": {
          code: "8604",
          name: "造船-上海虹桥分公司-行政部-上海"
        },
        "8605": {
          code: "8605",
          name: "造船-上海虹桥分公司-电装室-上海"
        },
        "8606": {
          code: "8606",
          name: "造船-上海虹桥分公司-商务部二部-上海"
        },
        "8607": {
          code: "8607",
          name: "造船-上海虹桥分公司-总体室-上海"
        },
        "8608": {
          code: "8608",
          name: "造船-上海虹桥分公司-居装室-上海"
        },
        "8609": {
          code: "8609",
          name: "造船-上海虹桥分公司-舾装室-上海"
        },
        "8610": {
          code: "8610",
          name: "造船-上海虹桥分公司-人事部-上海"
        }
      }
    },
    "造船-南通分公司": {
      code: "8700",
      workshops: {
        "8701": {
          code: "8701",
          name: "造船-南通分公司-行政部-南通"
        },
        "8702": {
          code: "8702",
          name: "造船-南通分公司-人事部-南通"
        },
        "8703": {
          code: "8703",
          name: "造船-南通分公司-居装室-南通"
        },
        "8704": {
          code: "8704",
          name: "造船-南通分公司-机装室-南通"
        },
        "8705": {
          code: "8705",
          name: "造船-南通分公司-船体室-南通"
        },
        "8706": {
          code: "8706",
          name: "造船-南通分公司-船装室-南通"
        },
        "8707": {
          code: "8707",
          name: "造船-南通分公司-电装室-南通"
        }
      }
    },
    "造船安环部": {
      code: "1200",
      workshops: {
        "1200": {
          code: "1200",
          name: "造船安环部"
        }
      }
    },
    "采购一部": {
      code: "0300",
      workshops: {
        "0300": {
          code: "0300",
          name: "采购一部"
        }
      }
    },
    "采购二部": {
      code: "0400",
      workshops: {
        "0400": {
          code: "0400",
          name: "采购二部"
        }
      }
    },
    "铁舾部": {
      code: "6400",
      workshops: {
        "6400": {
          code: "6400",
          name: "铁舾部"
        }
      }
    },
    "镀锌车间": {
      code: "6500",
      workshops: {
        "6500": {
          code: "6500",
          name: "镀锌车间"
        }
      }
    },
    "项目部": {
      code: "2400",
      workshops: {
        "2400": {
          code: "2400",
          name: "项目部"
        }
      }
    }
  };

module.exports = { DICT, DEVICE_TYPE_TREE, TYPE_CODE_MAP, DEPT_CODE_MAP, WORKSHOP_CODE_MAP, DEPT_WORKSHOP_TREE, getTopLevelCategories, getCategoryCodes };
